ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
/***************************************************************************//**
* \file cyip_udb.h
*
* \brief
* UDB IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_UDB_H_
#define _CYIP_UDB_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                            UDB                                            ================ */
/* =========================================================================================================================== */

#define UDB_WRKONE_SECTION_SIZE     0x00000800UL
#define UDB_WRKMULT_SECTION_SIZE    0x00001000UL
#define UDB_UDBPAIR_UDBSNG_SECTION_SIZE 0x00000080UL
#define UDB_UDBPAIR_ROUTE_SECTION_SIZE 0x00000100UL
#define UDB_UDBPAIR_SECTION_SIZE    0x00000200UL
#define UDB_DSI_SECTION_SIZE        0x00000080UL
#define UDB_PA_SECTION_SIZE         0x00000040UL
#define UDB_BCTL_SECTION_SIZE       0x00000080UL
#define UDB_UDBIF_SECTION_SIZE      0x00000020UL
#define UDB_SECTION_SIZE            0x00010000UL

/**
  * \brief UDB Working Registers (2 registers from one UDB at a time) (UDB_WRKONE)
  */
typedef struct {
  __IOM uint32_t A[64];                         /*!< 0x00000000 Accumulator Registers {A1,A0}                                  */
  __IOM uint32_t D[64];                         /*!< 0x00000100 Data Registers {D1,D0}                                         */
  __IOM uint32_t F[64];                         /*!< 0x00000200 FIFOs {F1,F0}                                                  */
  __IOM uint32_t CTL_ST[64];                    /*!< 0x00000300 Status and Control Registers {CTL,ST}                          */
  __IOM uint32_t ACTL_MSK[64];                  /*!< 0x00000400 Mask and Auxiliary Control Registers {ACTL,MSK}                */
   __IM uint32_t MC[64];                        /*!< 0x00000500 PLD Macrocell Read Registers {00,MC}                           */
   __IM uint32_t RESERVED[128];
} UDB_WRKONE_Type;                              /*!< Size = 1536 (0x600)                                                       */

/**
  * \brief UDB Working Registers (1 register from multiple UDBs at a time) (UDB_WRKMULT)
  */
typedef struct {
  __IOM uint32_t A0[64];                        /*!< 0x00000000 Accumulator 0                                                  */
  __IOM uint32_t A1[64];                        /*!< 0x00000100 Accumulator 1                                                  */
  __IOM uint32_t D0[64];                        /*!< 0x00000200 Data 0                                                         */
  __IOM uint32_t D1[64];                        /*!< 0x00000300 Data 1                                                         */
  __IOM uint32_t F0[64];                        /*!< 0x00000400 FIFO 0                                                         */
  __IOM uint32_t F1[64];                        /*!< 0x00000500 FIFO 1                                                         */
   __IM uint32_t ST[64];                        /*!< 0x00000600 Status Register                                                */
  __IOM uint32_t CTL[64];                       /*!< 0x00000700 Control Register                                               */
  __IOM uint32_t MSK[64];                       /*!< 0x00000800 Interrupt Mask                                                 */
  __IOM uint32_t ACTL[64];                      /*!< 0x00000900 Auxiliary Control                                              */
   __IM uint32_t MC[64];                        /*!< 0x00000A00 PLD Macrocell reading                                          */
   __IM uint32_t RESERVED[320];
} UDB_WRKMULT_Type;                             /*!< Size = 2816 (0xB00)                                                       */

/**
  * \brief Single UDB Configuration (UDB_UDBPAIR_UDBSNG)
  */
typedef struct {
  __IOM uint32_t PLD_IT[12];                    /*!< 0x00000000 PLD Input Terms                                                */
  __IOM uint32_t PLD_ORT0;                      /*!< 0x00000030 PLD OR Terms                                                   */
  __IOM uint32_t PLD_ORT1;                      /*!< 0x00000034 PLD OR Terms                                                   */
  __IOM uint32_t PLD_CFG0;                      /*!< 0x00000038 PLD configuration for Carry Enable, Constant, and XOR feedback */
  __IOM uint32_t PLD_CFG1;                      /*!< 0x0000003C PLD configuration for Set / Reset selection, and Bypass control*/
  __IOM uint32_t DPATH_CFG0;                    /*!< 0x00000040 Datapath input selections (RAD0, RAD1, RAD2, F0_LD, F1_LD,
                                                                D0_LD, D1_LD)                                                  */
  __IOM uint32_t DPATH_CFG1;                    /*!< 0x00000044 Datapath input and output selections (SCI_MUX, SI_MUX, OUT0
                                                                thru OUT5)                                                     */
  __IOM uint32_t DPATH_CFG2;                    /*!< 0x00000048 Datapath output synchronization, ALU mask, compare 0 and 1
                                                                masks                                                          */
  __IOM uint32_t DPATH_CFG3;                    /*!< 0x0000004C Datapath mask enables, shift in, carry in, compare, chaining,
                                                                MSB configs; FIFO, shift and parallel input control            */
  __IOM uint32_t DPATH_CFG4;                    /*!< 0x00000050 Datapath FIFO and register access configuration control        */
  __IOM uint32_t SC_CFG0;                       /*!< 0x00000054 SC Mode 0 and 1 control registers; status register input mode;
                                                                general SC configuration                                       */
  __IOM uint32_t SC_CFG1;                       /*!< 0x00000058 SC counter control                                             */
  __IOM uint32_t RC_CFG0;                       /*!< 0x0000005C PLD0, PLD1, Datatpath, and SC clock and reset control          */
  __IOM uint32_t RC_CFG1;                       /*!< 0x00000060 PLD0, PLD1, Datatpath, and SC clock selection, general reset
                                                                control                                                        */
  __IOM uint32_t DPATH_OPC[4];                  /*!< 0x00000064 Datapath opcode configuration                                  */
   __IM uint32_t RESERVED[3];
} UDB_UDBPAIR_UDBSNG_Type;                      /*!< Size = 116 (0x74)                                                         */

/**
  * \brief Routing Configuration for one UDB Pair (UDB_UDBPAIR_ROUTE)
  */
typedef struct {
  __IOM uint32_t TOP_V_BOT;                     /*!< 0x00000000 See mxudb BROS 002-10714 Appendix A section 'TVI vs. BVI
                                                                Muxing'                                                        */
  __IOM uint32_t LVI1_V_2;                      /*!< 0x00000004 See mxudb BROS 002-10714 Appendix A section 'LVI / RVI for
                                                                Horizontal Muxing'                                             */
  __IOM uint32_t RVI1_V_2;                      /*!< 0x00000008 See mxudb BROS 002-10714 Appendix A section 'LVI / RVI for
                                                                Horizontal Muxing'                                             */
  __IOM uint32_t TUI_CFG0;                      /*!< 0x0000000C See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t TUI_CFG1;                      /*!< 0x00000010 See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t TUI_CFG2;                      /*!< 0x00000014 See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t TUI_CFG3;                      /*!< 0x00000018 See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t TUI_CFG4;                      /*!< 0x0000001C See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t TUI_CFG5;                      /*!< 0x00000020 See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t BUI_CFG0;                      /*!< 0x00000024 See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t BUI_CFG1;                      /*!< 0x00000028 See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t BUI_CFG2;                      /*!< 0x0000002C See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t BUI_CFG3;                      /*!< 0x00000030 See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t BUI_CFG4;                      /*!< 0x00000034 See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t BUI_CFG5;                      /*!< 0x00000038 See mxudb BROS 002-10714 Appendix A section 'TUI / BUI Muxing' */
  __IOM uint32_t RVO_CFG0;                      /*!< 0x0000003C See mxudb BROS 002-10714 Appendix A section 'RVO Muxing'       */
  __IOM uint32_t RVO_CFG1;                      /*!< 0x00000040 See mxudb BROS 002-10714 Appendix A section 'RVO Muxing'       */
  __IOM uint32_t RVO_CFG2;                      /*!< 0x00000044 See mxudb BROS 002-10714 Appendix A section 'RVO Muxing'       */
  __IOM uint32_t RVO_CFG3;                      /*!< 0x00000048 See mxudb BROS 002-10714 Appendix A section 'RVO Muxing'       */
  __IOM uint32_t LVO_CFG0;                      /*!< 0x0000004C See mxudb BROS 002-10714 Appendix A section 'LVO Muxing'       */
  __IOM uint32_t LVO_CFG1;                      /*!< 0x00000050 See mxudb BROS 002-10714 Appendix A section 'LVO Muxing'       */
  __IOM uint32_t RHO_CFG0;                      /*!< 0x00000054 See mxudb BROS 002-10714 Appendix A section 'RHO Muxing'       */
  __IOM uint32_t RHO_CFG1;                      /*!< 0x00000058 See mxudb BROS 002-10714 Appendix A section 'RHO Muxing'       */
  __IOM uint32_t RHO_CFG2;                      /*!< 0x0000005C See mxudb BROS 002-10714 Appendix A section 'RHO Muxing'       */
  __IOM uint32_t LHO_CFG0;                      /*!< 0x00000060 See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG1;                      /*!< 0x00000064 See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG2;                      /*!< 0x00000068 See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG3;                      /*!< 0x0000006C See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG4;                      /*!< 0x00000070 See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG5;                      /*!< 0x00000074 See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG6;                      /*!< 0x00000078 See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG7;                      /*!< 0x0000007C See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG8;                      /*!< 0x00000080 See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG9;                      /*!< 0x00000084 See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG10;                     /*!< 0x00000088 See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
  __IOM uint32_t LHO_CFG11;                     /*!< 0x0000008C See mxudb BROS 002-10714 Appendix A section 'LHO Muxing'       */
   __IM uint32_t RESERVED[28];
} UDB_UDBPAIR_ROUTE_Type;                       /*!< Size = 144 (0x90)                                                         */

/**
  * \brief UDB Pair Configuration (up to 32 Pairs) (UDB_UDBPAIR)
  */
typedef struct {
        UDB_UDBPAIR_UDBSNG_Type UDBSNG[2];      /*!< 0x00000000 Single UDB Configuration                                       */
        UDB_UDBPAIR_ROUTE_Type ROUTE;           /*!< 0x00000100 Routing Configuration for one UDB Pair                         */
} UDB_UDBPAIR_Type;                             /*!< Size = 512 (0x200)                                                        */

/**
  * \brief DSI Configuration (up to 32 DSI) (UDB_DSI)
  */
typedef struct {
  __IOM uint32_t LVI1_V_2;                      /*!< 0x00000000 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LVI / RVI for Horizontal Muxing' as
                                                                being equivalent                                               */
  __IOM uint32_t RVI1_V_2;                      /*!< 0x00000004 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LVI / RVI for Horizontal Muxing' as
                                                                being equivalent                                               */
  __IOM uint32_t DOP_CFG0;                      /*!< 0x00000008 See mxudb BROS 002-10714 Appendix B section 'DOP Muxing'       */
  __IOM uint32_t DOP_CFG1;                      /*!< 0x0000000C See mxudb BROS 002-10714 Appendix B section 'DOP Muxing'       */
  __IOM uint32_t DOP_CFG2;                      /*!< 0x00000010 See mxudb BROS 002-10714 Appendix B section 'DOP Muxing'       */
  __IOM uint32_t DOP_CFG3;                      /*!< 0x00000014 See mxudb BROS 002-10714 Appendix B section 'DOP Muxing'       */
  __IOM uint32_t DOT_CFG0;                      /*!< 0x00000018 See mxudb BROS 002-10714 Appendix B section 'DOT Muxing'       */
  __IOM uint32_t DOT_CFG1;                      /*!< 0x0000001C See mxudb BROS 002-10714 Appendix B section 'DOT Muxing'       */
  __IOM uint32_t DOT_CFG2;                      /*!< 0x00000020 See mxudb BROS 002-10714 Appendix B section 'DOT Muxing'       */
  __IOM uint32_t DOT_CFG3;                      /*!< 0x00000024 See mxudb BROS 002-10714 Appendix B section 'DOT Muxing'       */
  __IOM uint32_t RVO_CFG0;                      /*!< 0x00000028 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'RVO Muxing' as being equivalent         */
  __IOM uint32_t RVO_CFG1;                      /*!< 0x0000002C See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'RVO Muxing' as being equivalent         */
  __IOM uint32_t RVO_CFG2;                      /*!< 0x00000030 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'RVO Muxing' as being equivalent         */
  __IOM uint32_t RVO_CFG3;                      /*!< 0x00000034 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'RVO Muxing' as being equivalent         */
  __IOM uint32_t LVO_CFG0;                      /*!< 0x00000038 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LVO Muxing' as being equivalent         */
  __IOM uint32_t LVO_CFG1;                      /*!< 0x0000003C See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LVO Muxing' as being equivalent         */
  __IOM uint32_t RHO_CFG0;                      /*!< 0x00000040 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'RHO Muxing' as being equivalent         */
  __IOM uint32_t RHO_CFG1;                      /*!< 0x00000044 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'RHO Muxing' as being equivalent         */
  __IOM uint32_t RHO_CFG2;                      /*!< 0x00000048 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'RHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG0;                      /*!< 0x0000004C See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG1;                      /*!< 0x00000050 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG2;                      /*!< 0x00000054 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG3;                      /*!< 0x00000058 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG4;                      /*!< 0x0000005C See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG5;                      /*!< 0x00000060 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG6;                      /*!< 0x00000064 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG7;                      /*!< 0x00000068 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG8;                      /*!< 0x0000006C See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG9;                      /*!< 0x00000070 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG10;                     /*!< 0x00000074 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
  __IOM uint32_t LHO_CFG11;                     /*!< 0x00000078 See mxudb BROS 002-10714 Appendix B DSI Routing which refers
                                                                to Appendix A section 'LHO Muxing' as being equivalent         */
   __IM uint32_t RESERVED;
} UDB_DSI_Type;                                 /*!< Size = 124 (0x7C)                                                         */

/**
  * \brief Port Adapter Configuration (up to 32 PA) (UDB_PA)
  */
typedef struct {
  __IOM uint32_t CFG0;                          /*!< 0x00000000 PA Data In Clock Control Register                              */
  __IOM uint32_t CFG1;                          /*!< 0x00000004 PA Data Out Clock Control Register                             */
  __IOM uint32_t CFG2;                          /*!< 0x00000008 PA Clock Select Register                                       */
  __IOM uint32_t CFG3;                          /*!< 0x0000000C PA Reset Select Register                                       */
  __IOM uint32_t CFG4;                          /*!< 0x00000010 PA Reset Enable Register                                       */
  __IOM uint32_t CFG5;                          /*!< 0x00000014 PA Reset Pin Select Register                                   */
  __IOM uint32_t CFG6;                          /*!< 0x00000018 PA Input Data Sync Control Register - Low                      */
  __IOM uint32_t CFG7;                          /*!< 0x0000001C PA Input Data Sync Control Register - High                     */
  __IOM uint32_t CFG8;                          /*!< 0x00000020 PA Output Data Sync Control Register - Low                     */
  __IOM uint32_t CFG9;                          /*!< 0x00000024 PA Output Data Sync Control Register - High                    */
  __IOM uint32_t CFG10;                         /*!< 0x00000028 PA Output Data Select Register - Low                           */
  __IOM uint32_t CFG11;                         /*!< 0x0000002C PA Output Data Select Register - High                          */
  __IOM uint32_t CFG12;                         /*!< 0x00000030 PA OE Select Register - Low                                    */
  __IOM uint32_t CFG13;                         /*!< 0x00000034 PA OE Select Register - High                                   */
  __IOM uint32_t CFG14;                         /*!< 0x00000038 PA OE Sync Register                                            */
   __IM uint32_t RESERVED;
} UDB_PA_Type;                                  /*!< Size = 60 (0x3C)                                                          */

/**
  * \brief UDB Array Bank Control (UDB_BCTL)
  */
typedef struct {
  __IOM uint32_t MDCLK_EN;                      /*!< 0x00000000 Master Digital Clock Enable Register                           */
  __IOM uint32_t MBCLK_EN;                      /*!< 0x00000004 Master clk_peri_app Enable Register                            */
  __IOM uint32_t BOTSEL_L;                      /*!< 0x00000008 Lower Nibble Bottom Digital Clock Select Register              */
  __IOM uint32_t BOTSEL_U;                      /*!< 0x0000000C Upper Nibble Bottom Digital Clock Select Register              */
  __IOM uint32_t QCLK_EN[16];                   /*!< 0x00000010 Quadrant Digital Clock Enable Registers                        */
   __IM uint32_t RESERVED[12];
} UDB_BCTL_Type;                                /*!< Size = 80 (0x50)                                                          */

