ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
/**
  * \brief UDB Subsystem Interface Configuration (UDB_UDBIF)
  */
typedef struct {
  __IOM uint32_t BANK_CTL;                      /*!< 0x00000000 Bank Control                                                   */
  __IOM uint32_t INT_CLK_CTL;                   /*!< 0x00000004 Interrupt Clock Control                                        */
  __IOM uint32_t INT_CFG;                       /*!< 0x00000008 Interrupt Configuration                                        */
  __IOM uint32_t TR_CLK_CTL;                    /*!< 0x0000000C Trigger Clock Control                                          */
  __IOM uint32_t TR_CFG;                        /*!< 0x00000010 Trigger Configuration                                          */
  __IOM uint32_t PRIVATE;                       /*!< 0x00000014 Internal use only                                              */
   __IM uint32_t RESERVED[2];
} UDB_UDBIF_Type;                               /*!< Size = 24 (0x18)                                                          */

/**
  * \brief Programmable Digital Subsystem (UDB)
  */
typedef struct {                                /*!< UDB Structure                                                             */
        UDB_WRKONE_Type WRKONE;                 /*!< 0x00000000 UDB Working Registers (2 registers from one UDB at a time)     */
   __IM uint32_t RESERVED[512];
        UDB_WRKMULT_Type WRKMULT;               /*!< 0x00001000 UDB Working Registers (1 register from multiple UDBs at a time)*/
        UDB_UDBPAIR_Type UDBPAIR[32];           /*!< 0x00002000 UDB Pair Configuration (up to 32 Pairs)                        */
        UDB_DSI_Type DSI[32];                   /*!< 0x00006000 DSI Configuration (up to 32 DSI)                               */
        UDB_PA_Type PA[32];                     /*!< 0x00007000 Port Adapter Configuration (up to 32 PA)                       */
        UDB_BCTL_Type BCTL;                     /*!< 0x00007800 UDB Array Bank Control                                         */
   __IM uint32_t RESERVED1[32];
        UDB_UDBIF_Type UDBIF;                   /*!< 0x00007900 UDB Subsystem Interface Configuration                          */
} UDB_Type;                                     /*!< Size = 31008 (0x7920)                                                     */


/* =====================================================  UDB_WRKONE.A  ====================================================== */
#define UDB_WRKONE_A_A0_Pos               (0UL)                 /*!< UDB_WRKONE A: A0 (Bit 0)                                  */
#define UDB_WRKONE_A_A0_Msk               (0xffUL)              /*!< UDB_WRKONE A: A0 (Bitfield-Mask: 0xff)                    */
#define UDB_WRKONE_A_A1_Pos               (8UL)                 /*!< UDB_WRKONE A: A1 (Bit 8)                                  */
#define UDB_WRKONE_A_A1_Msk               (0xff00UL)            /*!< UDB_WRKONE A: A1 (Bitfield-Mask: 0xff)                    */
/* =====================================================  UDB_WRKONE.D  ====================================================== */
#define UDB_WRKONE_D_D0_Pos               (0UL)                 /*!< UDB_WRKONE D: D0 (Bit 0)                                  */
#define UDB_WRKONE_D_D0_Msk               (0xffUL)              /*!< UDB_WRKONE D: D0 (Bitfield-Mask: 0xff)                    */
#define UDB_WRKONE_D_D1_Pos               (8UL)                 /*!< UDB_WRKONE D: D1 (Bit 8)                                  */
#define UDB_WRKONE_D_D1_Msk               (0xff00UL)            /*!< UDB_WRKONE D: D1 (Bitfield-Mask: 0xff)                    */
/* =====================================================  UDB_WRKONE.F  ====================================================== */
#define UDB_WRKONE_F_F0_Pos               (0UL)                 /*!< UDB_WRKONE F: F0 (Bit 0)                                  */
#define UDB_WRKONE_F_F0_Msk               (0xffUL)              /*!< UDB_WRKONE F: F0 (Bitfield-Mask: 0xff)                    */
#define UDB_WRKONE_F_F1_Pos               (8UL)                 /*!< UDB_WRKONE F: F1 (Bit 8)                                  */
#define UDB_WRKONE_F_F1_Msk               (0xff00UL)            /*!< UDB_WRKONE F: F1 (Bitfield-Mask: 0xff)                    */
/* ===================================================  UDB_WRKONE.CTL_ST  =================================================== */
#define UDB_WRKONE_CTL_ST_ST_Pos          (0UL)                 /*!< UDB_WRKONE CTL_ST: ST (Bit 0)                             */
#define UDB_WRKONE_CTL_ST_ST_Msk          (0xffUL)              /*!< UDB_WRKONE CTL_ST: ST (Bitfield-Mask: 0xff)               */
#define UDB_WRKONE_CTL_ST_CTL_Pos         (8UL)                 /*!< UDB_WRKONE CTL_ST: CTL (Bit 8)                            */
#define UDB_WRKONE_CTL_ST_CTL_Msk         (0xff00UL)            /*!< UDB_WRKONE CTL_ST: CTL (Bitfield-Mask: 0xff)              */
/* ==================================================  UDB_WRKONE.ACTL_MSK  ================================================== */
#define UDB_WRKONE_ACTL_MSK_MSK_Pos       (0UL)                 /*!< UDB_WRKONE ACTL_MSK: MSK (Bit 0)                          */
#define UDB_WRKONE_ACTL_MSK_MSK_Msk       (0x7fUL)              /*!< UDB_WRKONE ACTL_MSK: MSK (Bitfield-Mask: 0x7f)            */
#define UDB_WRKONE_ACTL_MSK_FIFO0_CLR_Pos (8UL)                 /*!< UDB_WRKONE ACTL_MSK: FIFO0_CLR (Bit 8)                    */
#define UDB_WRKONE_ACTL_MSK_FIFO0_CLR_Msk (0x100UL)             /*!< UDB_WRKONE ACTL_MSK: FIFO0_CLR (Bitfield-Mask: 0x01)      */
#define UDB_WRKONE_ACTL_MSK_FIFO1_CLR_Pos (9UL)                 /*!< UDB_WRKONE ACTL_MSK: FIFO1_CLR (Bit 9)                    */
#define UDB_WRKONE_ACTL_MSK_FIFO1_CLR_Msk (0x200UL)             /*!< UDB_WRKONE ACTL_MSK: FIFO1_CLR (Bitfield-Mask: 0x01)      */
#define UDB_WRKONE_ACTL_MSK_FIFO0_LVL_Pos (10UL)                /*!< UDB_WRKONE ACTL_MSK: FIFO0_LVL (Bit 10)                   */
#define UDB_WRKONE_ACTL_MSK_FIFO0_LVL_Msk (0x400UL)             /*!< UDB_WRKONE ACTL_MSK: FIFO0_LVL (Bitfield-Mask: 0x01)      */
#define UDB_WRKONE_ACTL_MSK_FIFO1_LVL_Pos (11UL)                /*!< UDB_WRKONE ACTL_MSK: FIFO1_LVL (Bit 11)                   */
#define UDB_WRKONE_ACTL_MSK_FIFO1_LVL_Msk (0x800UL)             /*!< UDB_WRKONE ACTL_MSK: FIFO1_LVL (Bitfield-Mask: 0x01)      */
#define UDB_WRKONE_ACTL_MSK_INT_EN_Pos    (12UL)                /*!< UDB_WRKONE ACTL_MSK: INT_EN (Bit 12)                      */
#define UDB_WRKONE_ACTL_MSK_INT_EN_Msk    (0x1000UL)            /*!< UDB_WRKONE ACTL_MSK: INT_EN (Bitfield-Mask: 0x01)         */
#define UDB_WRKONE_ACTL_MSK_CNT_START_Pos (13UL)                /*!< UDB_WRKONE ACTL_MSK: CNT_START (Bit 13)                   */
#define UDB_WRKONE_ACTL_MSK_CNT_START_Msk (0x2000UL)            /*!< UDB_WRKONE ACTL_MSK: CNT_START (Bitfield-Mask: 0x01)      */
/* =====================================================  UDB_WRKONE.MC  ===================================================== */
#define UDB_WRKONE_MC_PLD0_MC_Pos         (0UL)                 /*!< UDB_WRKONE MC: PLD0_MC (Bit 0)                            */
#define UDB_WRKONE_MC_PLD0_MC_Msk         (0xfUL)               /*!< UDB_WRKONE MC: PLD0_MC (Bitfield-Mask: 0x0f)              */
#define UDB_WRKONE_MC_PLD1_MC_Pos         (4UL)                 /*!< UDB_WRKONE MC: PLD1_MC (Bit 4)                            */
#define UDB_WRKONE_MC_PLD1_MC_Msk         (0xf0UL)              /*!< UDB_WRKONE MC: PLD1_MC (Bitfield-Mask: 0x0f)              */


