ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
/* ====================================================  UDB_WRKMULT.A0  ===================================================== */
#define UDB_WRKMULT_A0_A0_0_Pos           (0UL)                 /*!< UDB_WRKMULT A0: A0_0 (Bit 0)                              */
#define UDB_WRKMULT_A0_A0_0_Msk           (0xffUL)              /*!< UDB_WRKMULT A0: A0_0 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_A0_A0_1_Pos           (8UL)                 /*!< UDB_WRKMULT A0: A0_1 (Bit 8)                              */
#define UDB_WRKMULT_A0_A0_1_Msk           (0xff00UL)            /*!< UDB_WRKMULT A0: A0_1 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_A0_A0_2_Pos           (16UL)                /*!< UDB_WRKMULT A0: A0_2 (Bit 16)                             */
#define UDB_WRKMULT_A0_A0_2_Msk           (0xff0000UL)          /*!< UDB_WRKMULT A0: A0_2 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_A0_A0_3_Pos           (24UL)                /*!< UDB_WRKMULT A0: A0_3 (Bit 24)                             */
#define UDB_WRKMULT_A0_A0_3_Msk           (0xff000000UL)        /*!< UDB_WRKMULT A0: A0_3 (Bitfield-Mask: 0xff)                */
/* ====================================================  UDB_WRKMULT.A1  ===================================================== */
#define UDB_WRKMULT_A1_A1_0_Pos           (0UL)                 /*!< UDB_WRKMULT A1: A1_0 (Bit 0)                              */
#define UDB_WRKMULT_A1_A1_0_Msk           (0xffUL)              /*!< UDB_WRKMULT A1: A1_0 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_A1_A1_1_Pos           (8UL)                 /*!< UDB_WRKMULT A1: A1_1 (Bit 8)                              */
#define UDB_WRKMULT_A1_A1_1_Msk           (0xff00UL)            /*!< UDB_WRKMULT A1: A1_1 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_A1_A1_2_Pos           (16UL)                /*!< UDB_WRKMULT A1: A1_2 (Bit 16)                             */
#define UDB_WRKMULT_A1_A1_2_Msk           (0xff0000UL)          /*!< UDB_WRKMULT A1: A1_2 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_A1_A1_3_Pos           (24UL)                /*!< UDB_WRKMULT A1: A1_3 (Bit 24)                             */
#define UDB_WRKMULT_A1_A1_3_Msk           (0xff000000UL)        /*!< UDB_WRKMULT A1: A1_3 (Bitfield-Mask: 0xff)                */
/* ====================================================  UDB_WRKMULT.D0  ===================================================== */
#define UDB_WRKMULT_D0_D0_0_Pos           (0UL)                 /*!< UDB_WRKMULT D0: D0_0 (Bit 0)                              */
#define UDB_WRKMULT_D0_D0_0_Msk           (0xffUL)              /*!< UDB_WRKMULT D0: D0_0 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_D0_D0_1_Pos           (8UL)                 /*!< UDB_WRKMULT D0: D0_1 (Bit 8)                              */
#define UDB_WRKMULT_D0_D0_1_Msk           (0xff00UL)            /*!< UDB_WRKMULT D0: D0_1 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_D0_D0_2_Pos           (16UL)                /*!< UDB_WRKMULT D0: D0_2 (Bit 16)                             */
#define UDB_WRKMULT_D0_D0_2_Msk           (0xff0000UL)          /*!< UDB_WRKMULT D0: D0_2 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_D0_D0_3_Pos           (24UL)                /*!< UDB_WRKMULT D0: D0_3 (Bit 24)                             */
#define UDB_WRKMULT_D0_D0_3_Msk           (0xff000000UL)        /*!< UDB_WRKMULT D0: D0_3 (Bitfield-Mask: 0xff)                */
/* ====================================================  UDB_WRKMULT.D1  ===================================================== */
#define UDB_WRKMULT_D1_D1_0_Pos           (0UL)                 /*!< UDB_WRKMULT D1: D1_0 (Bit 0)                              */
#define UDB_WRKMULT_D1_D1_0_Msk           (0xffUL)              /*!< UDB_WRKMULT D1: D1_0 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_D1_D1_1_Pos           (8UL)                 /*!< UDB_WRKMULT D1: D1_1 (Bit 8)                              */
#define UDB_WRKMULT_D1_D1_1_Msk           (0xff00UL)            /*!< UDB_WRKMULT D1: D1_1 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_D1_D1_2_Pos           (16UL)                /*!< UDB_WRKMULT D1: D1_2 (Bit 16)                             */
#define UDB_WRKMULT_D1_D1_2_Msk           (0xff0000UL)          /*!< UDB_WRKMULT D1: D1_2 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_D1_D1_3_Pos           (24UL)                /*!< UDB_WRKMULT D1: D1_3 (Bit 24)                             */
#define UDB_WRKMULT_D1_D1_3_Msk           (0xff000000UL)        /*!< UDB_WRKMULT D1: D1_3 (Bitfield-Mask: 0xff)                */
/* ====================================================  UDB_WRKMULT.F0  ===================================================== */
#define UDB_WRKMULT_F0_F0_0_Pos           (0UL)                 /*!< UDB_WRKMULT F0: F0_0 (Bit 0)                              */
#define UDB_WRKMULT_F0_F0_0_Msk           (0xffUL)              /*!< UDB_WRKMULT F0: F0_0 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_F0_F0_1_Pos           (8UL)                 /*!< UDB_WRKMULT F0: F0_1 (Bit 8)                              */
#define UDB_WRKMULT_F0_F0_1_Msk           (0xff00UL)            /*!< UDB_WRKMULT F0: F0_1 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_F0_F0_2_Pos           (16UL)                /*!< UDB_WRKMULT F0: F0_2 (Bit 16)                             */
#define UDB_WRKMULT_F0_F0_2_Msk           (0xff0000UL)          /*!< UDB_WRKMULT F0: F0_2 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_F0_F0_3_Pos           (24UL)                /*!< UDB_WRKMULT F0: F0_3 (Bit 24)                             */
#define UDB_WRKMULT_F0_F0_3_Msk           (0xff000000UL)        /*!< UDB_WRKMULT F0: F0_3 (Bitfield-Mask: 0xff)                */
/* ====================================================  UDB_WRKMULT.F1  ===================================================== */
#define UDB_WRKMULT_F1_F1_0_Pos           (0UL)                 /*!< UDB_WRKMULT F1: F1_0 (Bit 0)                              */
#define UDB_WRKMULT_F1_F1_0_Msk           (0xffUL)              /*!< UDB_WRKMULT F1: F1_0 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_F1_F1_1_Pos           (8UL)                 /*!< UDB_WRKMULT F1: F1_1 (Bit 8)                              */
#define UDB_WRKMULT_F1_F1_1_Msk           (0xff00UL)            /*!< UDB_WRKMULT F1: F1_1 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_F1_F1_2_Pos           (16UL)                /*!< UDB_WRKMULT F1: F1_2 (Bit 16)                             */
#define UDB_WRKMULT_F1_F1_2_Msk           (0xff0000UL)          /*!< UDB_WRKMULT F1: F1_2 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_F1_F1_3_Pos           (24UL)                /*!< UDB_WRKMULT F1: F1_3 (Bit 24)                             */
#define UDB_WRKMULT_F1_F1_3_Msk           (0xff000000UL)        /*!< UDB_WRKMULT F1: F1_3 (Bitfield-Mask: 0xff)                */
/* ====================================================  UDB_WRKMULT.ST  ===================================================== */
#define UDB_WRKMULT_ST_ST_0_Pos           (0UL)                 /*!< UDB_WRKMULT ST: ST_0 (Bit 0)                              */
#define UDB_WRKMULT_ST_ST_0_Msk           (0xffUL)              /*!< UDB_WRKMULT ST: ST_0 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_ST_ST_1_Pos           (8UL)                 /*!< UDB_WRKMULT ST: ST_1 (Bit 8)                              */
#define UDB_WRKMULT_ST_ST_1_Msk           (0xff00UL)            /*!< UDB_WRKMULT ST: ST_1 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_ST_ST_2_Pos           (16UL)                /*!< UDB_WRKMULT ST: ST_2 (Bit 16)                             */
#define UDB_WRKMULT_ST_ST_2_Msk           (0xff0000UL)          /*!< UDB_WRKMULT ST: ST_2 (Bitfield-Mask: 0xff)                */
#define UDB_WRKMULT_ST_ST_3_Pos           (24UL)                /*!< UDB_WRKMULT ST: ST_3 (Bit 24)                             */
#define UDB_WRKMULT_ST_ST_3_Msk           (0xff000000UL)        /*!< UDB_WRKMULT ST: ST_3 (Bitfield-Mask: 0xff)                */
/* ====================================================  UDB_WRKMULT.CTL  ==================================================== */
#define UDB_WRKMULT_CTL_CTL_0_Pos         (0UL)                 /*!< UDB_WRKMULT CTL: CTL_0 (Bit 0)                            */
#define UDB_WRKMULT_CTL_CTL_0_Msk         (0xffUL)              /*!< UDB_WRKMULT CTL: CTL_0 (Bitfield-Mask: 0xff)              */
#define UDB_WRKMULT_CTL_CTL_1_Pos         (8UL)                 /*!< UDB_WRKMULT CTL: CTL_1 (Bit 8)                            */
#define UDB_WRKMULT_CTL_CTL_1_Msk         (0xff00UL)            /*!< UDB_WRKMULT CTL: CTL_1 (Bitfield-Mask: 0xff)              */
#define UDB_WRKMULT_CTL_CTL_2_Pos         (16UL)                /*!< UDB_WRKMULT CTL: CTL_2 (Bit 16)                           */
#define UDB_WRKMULT_CTL_CTL_2_Msk         (0xff0000UL)          /*!< UDB_WRKMULT CTL: CTL_2 (Bitfield-Mask: 0xff)              */
#define UDB_WRKMULT_CTL_CTL_3_Pos         (24UL)                /*!< UDB_WRKMULT CTL: CTL_3 (Bit 24)                           */
#define UDB_WRKMULT_CTL_CTL_3_Msk         (0xff000000UL)        /*!< UDB_WRKMULT CTL: CTL_3 (Bitfield-Mask: 0xff)              */
/* ====================================================  UDB_WRKMULT.MSK  ==================================================== */
#define UDB_WRKMULT_MSK_MSK_0_Pos         (0UL)                 /*!< UDB_WRKMULT MSK: MSK_0 (Bit 0)                            */
#define UDB_WRKMULT_MSK_MSK_0_Msk         (0x7fUL)              /*!< UDB_WRKMULT MSK: MSK_0 (Bitfield-Mask: 0x7f)              */
#define UDB_WRKMULT_MSK_MSK_1_Pos         (8UL)                 /*!< UDB_WRKMULT MSK: MSK_1 (Bit 8)                            */
#define UDB_WRKMULT_MSK_MSK_1_Msk         (0x7f00UL)            /*!< UDB_WRKMULT MSK: MSK_1 (Bitfield-Mask: 0x7f)              */
#define UDB_WRKMULT_MSK_MSK_2_Pos         (16UL)                /*!< UDB_WRKMULT MSK: MSK_2 (Bit 16)                           */
#define UDB_WRKMULT_MSK_MSK_2_Msk         (0x7f0000UL)          /*!< UDB_WRKMULT MSK: MSK_2 (Bitfield-Mask: 0x7f)              */
#define UDB_WRKMULT_MSK_MSK_3_Pos         (24UL)                /*!< UDB_WRKMULT MSK: MSK_3 (Bit 24)                           */
#define UDB_WRKMULT_MSK_MSK_3_Msk         (0x7f000000UL)        /*!< UDB_WRKMULT MSK: MSK_3 (Bitfield-Mask: 0x7f)              */
/* ===================================================  UDB_WRKMULT.ACTL  ==================================================== */
#define UDB_WRKMULT_ACTL_FIFO0_CLR_0_Pos  (0UL)                 /*!< UDB_WRKMULT ACTL: FIFO0_CLR_0 (Bit 0)                     */
#define UDB_WRKMULT_ACTL_FIFO0_CLR_0_Msk  (0x1UL)               /*!< UDB_WRKMULT ACTL: FIFO0_CLR_0 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO1_CLR_0_Pos  (1UL)                 /*!< UDB_WRKMULT ACTL: FIFO1_CLR_0 (Bit 1)                     */
#define UDB_WRKMULT_ACTL_FIFO1_CLR_0_Msk  (0x2UL)               /*!< UDB_WRKMULT ACTL: FIFO1_CLR_0 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO0_LVL_0_Pos  (2UL)                 /*!< UDB_WRKMULT ACTL: FIFO0_LVL_0 (Bit 2)                     */
#define UDB_WRKMULT_ACTL_FIFO0_LVL_0_Msk  (0x4UL)               /*!< UDB_WRKMULT ACTL: FIFO0_LVL_0 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO1_LVL_0_Pos  (3UL)                 /*!< UDB_WRKMULT ACTL: FIFO1_LVL_0 (Bit 3)                     */
#define UDB_WRKMULT_ACTL_FIFO1_LVL_0_Msk  (0x8UL)               /*!< UDB_WRKMULT ACTL: FIFO1_LVL_0 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_INT_EN_0_Pos     (4UL)                 /*!< UDB_WRKMULT ACTL: INT_EN_0 (Bit 4)                        */
#define UDB_WRKMULT_ACTL_INT_EN_0_Msk     (0x10UL)              /*!< UDB_WRKMULT ACTL: INT_EN_0 (Bitfield-Mask: 0x01)          */
#define UDB_WRKMULT_ACTL_CNT_START_0_Pos  (5UL)                 /*!< UDB_WRKMULT ACTL: CNT_START_0 (Bit 5)                     */
#define UDB_WRKMULT_ACTL_CNT_START_0_Msk  (0x20UL)              /*!< UDB_WRKMULT ACTL: CNT_START_0 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO0_CLR_1_Pos  (8UL)                 /*!< UDB_WRKMULT ACTL: FIFO0_CLR_1 (Bit 8)                     */
#define UDB_WRKMULT_ACTL_FIFO0_CLR_1_Msk  (0x100UL)             /*!< UDB_WRKMULT ACTL: FIFO0_CLR_1 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO1_CLR_1_Pos  (9UL)                 /*!< UDB_WRKMULT ACTL: FIFO1_CLR_1 (Bit 9)                     */
#define UDB_WRKMULT_ACTL_FIFO1_CLR_1_Msk  (0x200UL)             /*!< UDB_WRKMULT ACTL: FIFO1_CLR_1 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO0_LVL_1_Pos  (10UL)                /*!< UDB_WRKMULT ACTL: FIFO0_LVL_1 (Bit 10)                    */
#define UDB_WRKMULT_ACTL_FIFO0_LVL_1_Msk  (0x400UL)             /*!< UDB_WRKMULT ACTL: FIFO0_LVL_1 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO1_LVL_1_Pos  (11UL)                /*!< UDB_WRKMULT ACTL: FIFO1_LVL_1 (Bit 11)                    */
#define UDB_WRKMULT_ACTL_FIFO1_LVL_1_Msk  (0x800UL)             /*!< UDB_WRKMULT ACTL: FIFO1_LVL_1 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_INT_EN_1_Pos     (12UL)                /*!< UDB_WRKMULT ACTL: INT_EN_1 (Bit 12)                       */
#define UDB_WRKMULT_ACTL_INT_EN_1_Msk     (0x1000UL)            /*!< UDB_WRKMULT ACTL: INT_EN_1 (Bitfield-Mask: 0x01)          */
#define UDB_WRKMULT_ACTL_CNT_START_1_Pos  (13UL)                /*!< UDB_WRKMULT ACTL: CNT_START_1 (Bit 13)                    */
#define UDB_WRKMULT_ACTL_CNT_START_1_Msk  (0x2000UL)            /*!< UDB_WRKMULT ACTL: CNT_START_1 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO0_CLR_2_Pos  (16UL)                /*!< UDB_WRKMULT ACTL: FIFO0_CLR_2 (Bit 16)                    */
#define UDB_WRKMULT_ACTL_FIFO0_CLR_2_Msk  (0x10000UL)           /*!< UDB_WRKMULT ACTL: FIFO0_CLR_2 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO1_CLR_2_Pos  (17UL)                /*!< UDB_WRKMULT ACTL: FIFO1_CLR_2 (Bit 17)                    */
#define UDB_WRKMULT_ACTL_FIFO1_CLR_2_Msk  (0x20000UL)           /*!< UDB_WRKMULT ACTL: FIFO1_CLR_2 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO0_LVL_2_Pos  (18UL)                /*!< UDB_WRKMULT ACTL: FIFO0_LVL_2 (Bit 18)                    */
#define UDB_WRKMULT_ACTL_FIFO0_LVL_2_Msk  (0x40000UL)           /*!< UDB_WRKMULT ACTL: FIFO0_LVL_2 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO1_LVL_2_Pos  (19UL)                /*!< UDB_WRKMULT ACTL: FIFO1_LVL_2 (Bit 19)                    */
#define UDB_WRKMULT_ACTL_FIFO1_LVL_2_Msk  (0x80000UL)           /*!< UDB_WRKMULT ACTL: FIFO1_LVL_2 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_INT_EN_2_Pos     (20UL)                /*!< UDB_WRKMULT ACTL: INT_EN_2 (Bit 20)                       */
#define UDB_WRKMULT_ACTL_INT_EN_2_Msk     (0x100000UL)          /*!< UDB_WRKMULT ACTL: INT_EN_2 (Bitfield-Mask: 0x01)          */
#define UDB_WRKMULT_ACTL_CNT_START_2_Pos  (21UL)                /*!< UDB_WRKMULT ACTL: CNT_START_2 (Bit 21)                    */
#define UDB_WRKMULT_ACTL_CNT_START_2_Msk  (0x200000UL)          /*!< UDB_WRKMULT ACTL: CNT_START_2 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO0_CLR_3_Pos  (24UL)                /*!< UDB_WRKMULT ACTL: FIFO0_CLR_3 (Bit 24)                    */
#define UDB_WRKMULT_ACTL_FIFO0_CLR_3_Msk  (0x1000000UL)         /*!< UDB_WRKMULT ACTL: FIFO0_CLR_3 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO1_CLR_3_Pos  (25UL)                /*!< UDB_WRKMULT ACTL: FIFO1_CLR_3 (Bit 25)                    */
#define UDB_WRKMULT_ACTL_FIFO1_CLR_3_Msk  (0x2000000UL)         /*!< UDB_WRKMULT ACTL: FIFO1_CLR_3 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO0_LVL_3_Pos  (26UL)                /*!< UDB_WRKMULT ACTL: FIFO0_LVL_3 (Bit 26)                    */
#define UDB_WRKMULT_ACTL_FIFO0_LVL_3_Msk  (0x4000000UL)         /*!< UDB_WRKMULT ACTL: FIFO0_LVL_3 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_FIFO1_LVL_3_Pos  (27UL)                /*!< UDB_WRKMULT ACTL: FIFO1_LVL_3 (Bit 27)                    */
#define UDB_WRKMULT_ACTL_FIFO1_LVL_3_Msk  (0x8000000UL)         /*!< UDB_WRKMULT ACTL: FIFO1_LVL_3 (Bitfield-Mask: 0x01)       */
#define UDB_WRKMULT_ACTL_INT_EN_3_Pos     (28UL)                /*!< UDB_WRKMULT ACTL: INT_EN_3 (Bit 28)                       */
#define UDB_WRKMULT_ACTL_INT_EN_3_Msk     (0x10000000UL)        /*!< UDB_WRKMULT ACTL: INT_EN_3 (Bitfield-Mask: 0x01)          */
#define UDB_WRKMULT_ACTL_CNT_START_3_Pos  (29UL)                /*!< UDB_WRKMULT ACTL: CNT_START_3 (Bit 29)                    */
#define UDB_WRKMULT_ACTL_CNT_START_3_Msk  (0x20000000UL)        /*!< UDB_WRKMULT ACTL: CNT_START_3 (Bitfield-Mask: 0x01)       */
/* ====================================================  UDB_WRKMULT.MC  ===================================================== */
#define UDB_WRKMULT_MC_PLD0_MC_0_Pos      (0UL)                 /*!< UDB_WRKMULT MC: PLD0_MC_0 (Bit 0)                         */
#define UDB_WRKMULT_MC_PLD0_MC_0_Msk      (0xfUL)               /*!< UDB_WRKMULT MC: PLD0_MC_0 (Bitfield-Mask: 0x0f)           */
#define UDB_WRKMULT_MC_PLD1_MC_0_Pos      (4UL)                 /*!< UDB_WRKMULT MC: PLD1_MC_0 (Bit 4)                         */
#define UDB_WRKMULT_MC_PLD1_MC_0_Msk      (0xf0UL)              /*!< UDB_WRKMULT MC: PLD1_MC_0 (Bitfield-Mask: 0x0f)           */
#define UDB_WRKMULT_MC_PLD0_MC_1_Pos      (8UL)                 /*!< UDB_WRKMULT MC: PLD0_MC_1 (Bit 8)                         */
#define UDB_WRKMULT_MC_PLD0_MC_1_Msk      (0xf00UL)             /*!< UDB_WRKMULT MC: PLD0_MC_1 (Bitfield-Mask: 0x0f)           */
#define UDB_WRKMULT_MC_PLD1_MC_1_Pos      (12UL)                /*!< UDB_WRKMULT MC: PLD1_MC_1 (Bit 12)                        */
#define UDB_WRKMULT_MC_PLD1_MC_1_Msk      (0xf000UL)            /*!< UDB_WRKMULT MC: PLD1_MC_1 (Bitfield-Mask: 0x0f)           */
#define UDB_WRKMULT_MC_PLD0_MC_2_Pos      (16UL)                /*!< UDB_WRKMULT MC: PLD0_MC_2 (Bit 16)                        */
#define UDB_WRKMULT_MC_PLD0_MC_2_Msk      (0xf0000UL)           /*!< UDB_WRKMULT MC: PLD0_MC_2 (Bitfield-Mask: 0x0f)           */
#define UDB_WRKMULT_MC_PLD1_MC_2_Pos      (20UL)                /*!< UDB_WRKMULT MC: PLD1_MC_2 (Bit 20)                        */
#define UDB_WRKMULT_MC_PLD1_MC_2_Msk      (0xf00000UL)          /*!< UDB_WRKMULT MC: PLD1_MC_2 (Bitfield-Mask: 0x0f)           */
#define UDB_WRKMULT_MC_PLD0_MC_3_Pos      (24UL)                /*!< UDB_WRKMULT MC: PLD0_MC_3 (Bit 24)                        */
#define UDB_WRKMULT_MC_PLD0_MC_3_Msk      (0xf000000UL)         /*!< UDB_WRKMULT MC: PLD0_MC_3 (Bitfield-Mask: 0x0f)           */
#define UDB_WRKMULT_MC_PLD1_MC_3_Pos      (28UL)                /*!< UDB_WRKMULT MC: PLD1_MC_3 (Bit 28)                        */
#define UDB_WRKMULT_MC_PLD1_MC_3_Msk      (0xf0000000UL)        /*!< UDB_WRKMULT MC: PLD1_MC_3 (Bitfield-Mask: 0x0f)           */


