ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
/* ===============================================  UDB_UDBPAIR_UDBSNG.PLD_IT  =============================================== */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT0_Pos (0UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT0 (Bit 0)     */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT0_Msk (0x1UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT1_Pos (1UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT1 (Bit 1)     */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT1_Msk (0x2UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT2_Pos (2UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT2 (Bit 2)     */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT2_Msk (0x4UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT3_Pos (3UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT3 (Bit 3)     */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT3_Msk (0x8UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT4_Pos (4UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT4 (Bit 4)     */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT4_Msk (0x10UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT4 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT5_Pos (5UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT5 (Bit 5)     */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT5_Msk (0x20UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT5 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT6_Pos (6UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT6 (Bit 6)     */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT6_Msk (0x40UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT6 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT7_Pos (7UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT7 (Bit 7)     */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_C_FOR_PT7_Msk (0x80UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_C_FOR_PT7 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT0_Pos (8UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT0 (Bit 8)     */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT0_Msk (0x100UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT1_Pos (9UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT1 (Bit 9)     */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT1_Msk (0x200UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT2_Pos (10UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT2 (Bit 10)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT2_Msk (0x400UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT3_Pos (11UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT3 (Bit 11)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT3_Msk (0x800UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT4_Pos (12UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT4 (Bit 12)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT4_Msk (0x1000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT4 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT5_Pos (13UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT5 (Bit 13)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT5_Msk (0x2000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT5 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT6_Pos (14UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT6 (Bit 14)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT6_Msk (0x4000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT6 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT7_Pos (15UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT7 (Bit 15)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_C_FOR_PT7_Msk (0x8000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_C_FOR_PT7 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT0_Pos (16UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT0 (Bit 16)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT0_Msk (0x10000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT1_Pos (17UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT1 (Bit 17)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT1_Msk (0x20000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT2_Pos (18UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT2 (Bit 18)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT2_Msk (0x40000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT3_Pos (19UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT3 (Bit 19)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT3_Msk (0x80000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT4_Pos (20UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT4 (Bit 20)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT4_Msk (0x100000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT4 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT5_Pos (21UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT5 (Bit 21)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT5_Msk (0x200000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT5 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT6_Pos (22UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT6 (Bit 22)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT6_Msk (0x400000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT6 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT7_Pos (23UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT7 (Bit 23)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD0_INX_T_FOR_PT7_Msk (0x800000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD0_INX_T_FOR_PT7 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT0_Pos (24UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT0 (Bit 24)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT0_Msk (0x1000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT1_Pos (25UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT1 (Bit 25)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT1_Msk (0x2000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT2_Pos (26UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT2 (Bit 26)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT2_Msk (0x4000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT3_Pos (27UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT3 (Bit 27)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT3_Msk (0x8000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT4_Pos (28UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT4 (Bit 28)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT4_Msk (0x10000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT4 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT5_Pos (29UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT5 (Bit 29)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT5_Msk (0x20000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT5 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT6_Pos (30UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT6 (Bit 30)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT6_Msk (0x40000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT6 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT7_Pos (31UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT7 (Bit 31)    */
#define UDB_UDBPAIR_UDBSNG_PLD_IT_PLD1_INX_T_FOR_PT7_Msk (0x80000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_IT: PLD1_INX_T_FOR_PT7 (Bitfield-Mask: 0x01)*/
/* ==============================================  UDB_UDBPAIR_UDBSNG.PLD_ORT0  ============================================== */
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT0_T_FOR_OUT0_Pos (0UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT0_T_FOR_OUT0 (Bit 0)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT0_T_FOR_OUT0_Msk (0x1UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT0_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT1_T_FOR_OUT0_Pos (1UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT1_T_FOR_OUT0 (Bit 1)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT1_T_FOR_OUT0_Msk (0x2UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT1_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT2_T_FOR_OUT0_Pos (2UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT2_T_FOR_OUT0 (Bit 2)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT2_T_FOR_OUT0_Msk (0x4UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT2_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT3_T_FOR_OUT0_Pos (3UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT3_T_FOR_OUT0 (Bit 3)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT3_T_FOR_OUT0_Msk (0x8UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT3_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT4_T_FOR_OUT0_Pos (4UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT4_T_FOR_OUT0 (Bit 4)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT4_T_FOR_OUT0_Msk (0x10UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT4_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT5_T_FOR_OUT0_Pos (5UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT5_T_FOR_OUT0 (Bit 5)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT5_T_FOR_OUT0_Msk (0x20UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT5_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT6_T_FOR_OUT0_Pos (6UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT6_T_FOR_OUT0 (Bit 6)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT6_T_FOR_OUT0_Msk (0x40UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT6_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT7_T_FOR_OUT0_Pos (7UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT7_T_FOR_OUT0 (Bit 7)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT7_T_FOR_OUT0_Msk (0x80UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT7_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT0_T_FOR_OUT0_Pos (8UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT0_T_FOR_OUT0 (Bit 8)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT0_T_FOR_OUT0_Msk (0x100UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT0_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT1_T_FOR_OUT0_Pos (9UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT1_T_FOR_OUT0 (Bit 9)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT1_T_FOR_OUT0_Msk (0x200UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT1_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT2_T_FOR_OUT0_Pos (10UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT2_T_FOR_OUT0 (Bit 10)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT2_T_FOR_OUT0_Msk (0x400UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT2_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT3_T_FOR_OUT0_Pos (11UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT3_T_FOR_OUT0 (Bit 11)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT3_T_FOR_OUT0_Msk (0x800UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT3_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT4_T_FOR_OUT0_Pos (12UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT4_T_FOR_OUT0 (Bit 12)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT4_T_FOR_OUT0_Msk (0x1000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT4_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT5_T_FOR_OUT0_Pos (13UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT5_T_FOR_OUT0 (Bit 13)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT5_T_FOR_OUT0_Msk (0x2000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT5_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT6_T_FOR_OUT0_Pos (14UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT6_T_FOR_OUT0 (Bit 14)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT6_T_FOR_OUT0_Msk (0x4000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT6_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT7_T_FOR_OUT0_Pos (15UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT7_T_FOR_OUT0 (Bit 15)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT7_T_FOR_OUT0_Msk (0x8000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT7_T_FOR_OUT0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT0_T_FOR_OUT1_Pos (16UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT0_T_FOR_OUT1 (Bit 16)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT0_T_FOR_OUT1_Msk (0x10000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT0_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT1_T_FOR_OUT1_Pos (17UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT1_T_FOR_OUT1 (Bit 17)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT1_T_FOR_OUT1_Msk (0x20000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT1_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT2_T_FOR_OUT1_Pos (18UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT2_T_FOR_OUT1 (Bit 18)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT2_T_FOR_OUT1_Msk (0x40000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT2_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT3_T_FOR_OUT1_Pos (19UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT3_T_FOR_OUT1 (Bit 19)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT3_T_FOR_OUT1_Msk (0x80000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT3_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT4_T_FOR_OUT1_Pos (20UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT4_T_FOR_OUT1 (Bit 20)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT4_T_FOR_OUT1_Msk (0x100000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT4_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT5_T_FOR_OUT1_Pos (21UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT5_T_FOR_OUT1 (Bit 21)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT5_T_FOR_OUT1_Msk (0x200000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT5_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT6_T_FOR_OUT1_Pos (22UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT6_T_FOR_OUT1 (Bit 22)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT6_T_FOR_OUT1_Msk (0x400000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT6_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT7_T_FOR_OUT1_Pos (23UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT7_T_FOR_OUT1 (Bit 23)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD0_PT7_T_FOR_OUT1_Msk (0x800000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD0_PT7_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT0_T_FOR_OUT1_Pos (24UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT0_T_FOR_OUT1 (Bit 24)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT0_T_FOR_OUT1_Msk (0x1000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT0_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT1_T_FOR_OUT1_Pos (25UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT1_T_FOR_OUT1 (Bit 25)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT1_T_FOR_OUT1_Msk (0x2000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT1_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT2_T_FOR_OUT1_Pos (26UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT2_T_FOR_OUT1 (Bit 26)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT2_T_FOR_OUT1_Msk (0x4000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT2_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT3_T_FOR_OUT1_Pos (27UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT3_T_FOR_OUT1 (Bit 27)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT3_T_FOR_OUT1_Msk (0x8000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT3_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT4_T_FOR_OUT1_Pos (28UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT4_T_FOR_OUT1 (Bit 28)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT4_T_FOR_OUT1_Msk (0x10000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT4_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT5_T_FOR_OUT1_Pos (29UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT5_T_FOR_OUT1 (Bit 29)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT5_T_FOR_OUT1_Msk (0x20000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT5_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT6_T_FOR_OUT1_Pos (30UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT6_T_FOR_OUT1 (Bit 30)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT6_T_FOR_OUT1_Msk (0x40000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT6_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT7_T_FOR_OUT1_Pos (31UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT7_T_FOR_OUT1 (Bit 31)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT0_PLD1_PT7_T_FOR_OUT1_Msk (0x80000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT0: PLD1_PT7_T_FOR_OUT1 (Bitfield-Mask: 0x01)*/
/* ==============================================  UDB_UDBPAIR_UDBSNG.PLD_ORT1  ============================================== */
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT0_T_FOR_OUT2_Pos (0UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT0_T_FOR_OUT2 (Bit 0)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT0_T_FOR_OUT2_Msk (0x1UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT0_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT1_T_FOR_OUT2_Pos (1UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT1_T_FOR_OUT2 (Bit 1)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT1_T_FOR_OUT2_Msk (0x2UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT1_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT2_T_FOR_OUT2_Pos (2UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT2_T_FOR_OUT2 (Bit 2)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT2_T_FOR_OUT2_Msk (0x4UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT2_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT3_T_FOR_OUT2_Pos (3UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT3_T_FOR_OUT2 (Bit 3)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT3_T_FOR_OUT2_Msk (0x8UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT3_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT4_T_FOR_OUT2_Pos (4UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT4_T_FOR_OUT2 (Bit 4)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT4_T_FOR_OUT2_Msk (0x10UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT4_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT5_T_FOR_OUT2_Pos (5UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT5_T_FOR_OUT2 (Bit 5)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT5_T_FOR_OUT2_Msk (0x20UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT5_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT6_T_FOR_OUT2_Pos (6UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT6_T_FOR_OUT2 (Bit 6)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT6_T_FOR_OUT2_Msk (0x40UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT6_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT7_T_FOR_OUT2_Pos (7UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT7_T_FOR_OUT2 (Bit 7)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT7_T_FOR_OUT2_Msk (0x80UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT7_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT0_T_FOR_OUT2_Pos (8UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT0_T_FOR_OUT2 (Bit 8)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT0_T_FOR_OUT2_Msk (0x100UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT0_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT1_T_FOR_OUT2_Pos (9UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT1_T_FOR_OUT2 (Bit 9)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT1_T_FOR_OUT2_Msk (0x200UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT1_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT2_T_FOR_OUT2_Pos (10UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT2_T_FOR_OUT2 (Bit 10)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT2_T_FOR_OUT2_Msk (0x400UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT2_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT3_T_FOR_OUT2_Pos (11UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT3_T_FOR_OUT2 (Bit 11)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT3_T_FOR_OUT2_Msk (0x800UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT3_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT4_T_FOR_OUT2_Pos (12UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT4_T_FOR_OUT2 (Bit 12)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT4_T_FOR_OUT2_Msk (0x1000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT4_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT5_T_FOR_OUT2_Pos (13UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT5_T_FOR_OUT2 (Bit 13)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT5_T_FOR_OUT2_Msk (0x2000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT5_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT6_T_FOR_OUT2_Pos (14UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT6_T_FOR_OUT2 (Bit 14)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT6_T_FOR_OUT2_Msk (0x4000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT6_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT7_T_FOR_OUT2_Pos (15UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT7_T_FOR_OUT2 (Bit 15)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT7_T_FOR_OUT2_Msk (0x8000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT7_T_FOR_OUT2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT0_T_FOR_OUT3_Pos (16UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT0_T_FOR_OUT3 (Bit 16)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT0_T_FOR_OUT3_Msk (0x10000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT0_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT1_T_FOR_OUT3_Pos (17UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT1_T_FOR_OUT3 (Bit 17)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT1_T_FOR_OUT3_Msk (0x20000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT1_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT2_T_FOR_OUT3_Pos (18UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT2_T_FOR_OUT3 (Bit 18)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT2_T_FOR_OUT3_Msk (0x40000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT2_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT3_T_FOR_OUT3_Pos (19UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT3_T_FOR_OUT3 (Bit 19)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT3_T_FOR_OUT3_Msk (0x80000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT3_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT4_T_FOR_OUT3_Pos (20UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT4_T_FOR_OUT3 (Bit 20)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT4_T_FOR_OUT3_Msk (0x100000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT4_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
