ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT5_T_FOR_OUT3_Pos (21UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT5_T_FOR_OUT3 (Bit 21)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT5_T_FOR_OUT3_Msk (0x200000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT5_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT6_T_FOR_OUT3_Pos (22UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT6_T_FOR_OUT3 (Bit 22)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT6_T_FOR_OUT3_Msk (0x400000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT6_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT7_T_FOR_OUT3_Pos (23UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT7_T_FOR_OUT3 (Bit 23)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD0_PT7_T_FOR_OUT3_Msk (0x800000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD0_PT7_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT0_T_FOR_OUT3_Pos (24UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT0_T_FOR_OUT3 (Bit 24)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT0_T_FOR_OUT3_Msk (0x1000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT0_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT1_T_FOR_OUT3_Pos (25UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT1_T_FOR_OUT3 (Bit 25)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT1_T_FOR_OUT3_Msk (0x2000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT1_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT2_T_FOR_OUT3_Pos (26UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT2_T_FOR_OUT3 (Bit 26)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT2_T_FOR_OUT3_Msk (0x4000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT2_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT3_T_FOR_OUT3_Pos (27UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT3_T_FOR_OUT3 (Bit 27)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT3_T_FOR_OUT3_Msk (0x8000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT3_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT4_T_FOR_OUT3_Pos (28UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT4_T_FOR_OUT3 (Bit 28)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT4_T_FOR_OUT3_Msk (0x10000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT4_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT5_T_FOR_OUT3_Pos (29UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT5_T_FOR_OUT3 (Bit 29)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT5_T_FOR_OUT3_Msk (0x20000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT5_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT6_T_FOR_OUT3_Pos (30UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT6_T_FOR_OUT3 (Bit 30)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT6_T_FOR_OUT3_Msk (0x40000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT6_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT7_T_FOR_OUT3_Pos (31UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT7_T_FOR_OUT3 (Bit 31)*/
#define UDB_UDBPAIR_UDBSNG_PLD_ORT1_PLD1_PT7_T_FOR_OUT3_Msk (0x80000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_ORT1: PLD1_PT7_T_FOR_OUT3 (Bitfield-Mask: 0x01)*/
/* ==============================================  UDB_UDBPAIR_UDBSNG.PLD_CFG0  ============================================== */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC0_CEN_Pos (0UL)      /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC0_CEN (Bit 0)         */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC0_CEN_Msk (0x1UL)    /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC0_CEN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC0_DFF_C_Pos (1UL)    /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC0_DFF_C (Bit 1)       */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC0_DFF_C_Msk (0x2UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC0_DFF_C (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC1_CEN_Pos (2UL)      /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC1_CEN (Bit 2)         */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC1_CEN_Msk (0x4UL)    /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC1_CEN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC1_DFF_C_Pos (3UL)    /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC1_DFF_C (Bit 3)       */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC1_DFF_C_Msk (0x8UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC1_DFF_C (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC2_CEN_Pos (4UL)      /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC2_CEN (Bit 4)         */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC2_CEN_Msk (0x10UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC2_CEN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC2_DFF_C_Pos (5UL)    /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC2_DFF_C (Bit 5)       */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC2_DFF_C_Msk (0x20UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC2_DFF_C (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC3_CEN_Pos (6UL)      /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC3_CEN (Bit 6)         */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC3_CEN_Msk (0x40UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC3_CEN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC3_DFF_C_Pos (7UL)    /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC3_DFF_C (Bit 7)       */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC3_DFF_C_Msk (0x80UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC3_DFF_C (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC0_CEN_Pos (8UL)      /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC0_CEN (Bit 8)         */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC0_CEN_Msk (0x100UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC0_CEN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC0_DFF_C_Pos (9UL)    /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC0_DFF_C (Bit 9)       */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC0_DFF_C_Msk (0x200UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC0_DFF_C (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC1_CEN_Pos (10UL)     /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC1_CEN (Bit 10)        */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC1_CEN_Msk (0x400UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC1_CEN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC1_DFF_C_Pos (11UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC1_DFF_C (Bit 11)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC1_DFF_C_Msk (0x800UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC1_DFF_C (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC2_CEN_Pos (12UL)     /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC2_CEN (Bit 12)        */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC2_CEN_Msk (0x1000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC2_CEN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC2_DFF_C_Pos (13UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC2_DFF_C (Bit 13)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC2_DFF_C_Msk (0x2000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC2_DFF_C (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC3_CEN_Pos (14UL)     /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC3_CEN (Bit 14)        */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC3_CEN_Msk (0x4000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC3_CEN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC3_DFF_C_Pos (15UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC3_DFF_C (Bit 15)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC3_DFF_C_Msk (0x8000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC3_DFF_C (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC0_XORFB_Pos (16UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC0_XORFB (Bit 16)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC0_XORFB_Msk (0x30000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC0_XORFB (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC1_XORFB_Pos (18UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC1_XORFB (Bit 18)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC1_XORFB_Msk (0xc0000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC1_XORFB (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC2_XORFB_Pos (20UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC2_XORFB (Bit 20)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC2_XORFB_Msk (0x300000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC2_XORFB (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC3_XORFB_Pos (22UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC3_XORFB (Bit 22)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD0_MC3_XORFB_Msk (0xc00000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD0_MC3_XORFB (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC0_XORFB_Pos (24UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC0_XORFB (Bit 24)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC0_XORFB_Msk (0x3000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC0_XORFB (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC1_XORFB_Pos (26UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC1_XORFB (Bit 26)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC1_XORFB_Msk (0xc000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC1_XORFB (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC2_XORFB_Pos (28UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC2_XORFB (Bit 28)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC2_XORFB_Msk (0x30000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC2_XORFB (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC3_XORFB_Pos (30UL)   /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC3_XORFB (Bit 30)      */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG0_PLD1_MC3_XORFB_Msk (0xc0000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG0: PLD1_MC3_XORFB (Bitfield-Mask: 0x03)*/
/* ==============================================  UDB_UDBPAIR_UDBSNG.PLD_CFG1  ============================================== */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC0_SET_SEL_Pos (0UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC0_SET_SEL (Bit 0)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC0_SET_SEL_Msk (0x1UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC0_SET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC0_RESET_SEL_Pos (1UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC0_RESET_SEL (Bit 1)  */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC0_RESET_SEL_Msk (0x2UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC0_RESET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC1_SET_SEL_Pos (2UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC1_SET_SEL (Bit 2)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC1_SET_SEL_Msk (0x4UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC1_SET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC1_RESET_SEL_Pos (3UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC1_RESET_SEL (Bit 3)  */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC1_RESET_SEL_Msk (0x8UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC1_RESET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC2_SET_SEL_Pos (4UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC2_SET_SEL (Bit 4)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC2_SET_SEL_Msk (0x10UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC2_SET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC2_RESET_SEL_Pos (5UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC2_RESET_SEL (Bit 5)  */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC2_RESET_SEL_Msk (0x20UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC2_RESET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC3_SET_SEL_Pos (6UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC3_SET_SEL (Bit 6)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC3_SET_SEL_Msk (0x40UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC3_SET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC3_RESET_SEL_Pos (7UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC3_RESET_SEL (Bit 7)  */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC3_RESET_SEL_Msk (0x80UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC3_RESET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC0_SET_SEL_Pos (8UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC0_SET_SEL (Bit 8)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC0_SET_SEL_Msk (0x100UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC0_SET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC0_RESET_SEL_Pos (9UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC0_RESET_SEL (Bit 9)  */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC0_RESET_SEL_Msk (0x200UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC0_RESET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC1_SET_SEL_Pos (10UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC1_SET_SEL (Bit 10)    */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC1_SET_SEL_Msk (0x400UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC1_SET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC1_RESET_SEL_Pos (11UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC1_RESET_SEL (Bit 11)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC1_RESET_SEL_Msk (0x800UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC1_RESET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC2_SET_SEL_Pos (12UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC2_SET_SEL (Bit 12)    */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC2_SET_SEL_Msk (0x1000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC2_SET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC2_RESET_SEL_Pos (13UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC2_RESET_SEL (Bit 13)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC2_RESET_SEL_Msk (0x2000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC2_RESET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC3_SET_SEL_Pos (14UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC3_SET_SEL (Bit 14)    */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC3_SET_SEL_Msk (0x4000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC3_SET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC3_RESET_SEL_Pos (15UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC3_RESET_SEL (Bit 15)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC3_RESET_SEL_Msk (0x8000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC3_RESET_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC0_BYPASS_Pos (16UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC0_BYPASS (Bit 16)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC0_BYPASS_Msk (0x10000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC0_BYPASS (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC1_BYPASS_Pos (18UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC1_BYPASS (Bit 18)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC1_BYPASS_Msk (0x40000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC1_BYPASS (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC2_BYPASS_Pos (20UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC2_BYPASS (Bit 20)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC2_BYPASS_Msk (0x100000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC2_BYPASS (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC3_BYPASS_Pos (22UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC3_BYPASS (Bit 22)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD0_MC3_BYPASS_Msk (0x400000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD0_MC3_BYPASS (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC0_BYPASS_Pos (24UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC0_BYPASS (Bit 24)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC0_BYPASS_Msk (0x1000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC0_BYPASS (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC1_BYPASS_Pos (26UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC1_BYPASS (Bit 26)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC1_BYPASS_Msk (0x4000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC1_BYPASS (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC2_BYPASS_Pos (28UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC2_BYPASS (Bit 28)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC2_BYPASS_Msk (0x10000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC2_BYPASS (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC3_BYPASS_Pos (30UL)  /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC3_BYPASS (Bit 30)     */
#define UDB_UDBPAIR_UDBSNG_PLD_CFG1_PLD1_MC3_BYPASS_Msk (0x40000000UL) /*!< UDB_UDBPAIR_UDBSNG PLD_CFG1: PLD1_MC3_BYPASS (Bitfield-Mask: 0x01)*/
/* =============================================  UDB_UDBPAIR_UDBSNG.DPATH_CFG0  ============================================= */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_RAD0_Pos (0UL)            /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: RAD0 (Bit 0)               */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_RAD0_Msk (0x7UL)          /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: RAD0 (Bitfield-Mask: 0x07) */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_RAD1_Pos (4UL)            /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: RAD1 (Bit 4)               */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_RAD1_Msk (0x70UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: RAD1 (Bitfield-Mask: 0x07) */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_RAD2_Pos (8UL)            /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: RAD2 (Bit 8)               */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_RAD2_Msk (0x700UL)        /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: RAD2 (Bitfield-Mask: 0x07) */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS0_Pos (11UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS0 (Bit 11)    */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS0_Msk (0x800UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS1_Pos (12UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS1 (Bit 12)    */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS1_Msk (0x1000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS2_Pos (13UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS2 (Bit 13)    */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS2_Msk (0x2000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS2 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS3_Pos (14UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS3 (Bit 14)    */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS3_Msk (0x4000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS3 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS4_Pos (15UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS4 (Bit 15)    */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS4_Msk (0x8000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS4 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_F0_LD_Pos (16UL)          /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: F0_LD (Bit 16)             */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_F0_LD_Msk (0x70000UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: F0_LD (Bitfield-Mask: 0x07)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS5_Pos (19UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS5 (Bit 19)    */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_DP_RTE_BYPASS5_Msk (0x80000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: DP_RTE_BYPASS5 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_F1_LD_Pos (20UL)          /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: F1_LD (Bit 20)             */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_F1_LD_Msk (0x700000UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: F1_LD (Bitfield-Mask: 0x07)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_D0_LD_Pos (24UL)          /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: D0_LD (Bit 24)             */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_D0_LD_Msk (0x7000000UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: D0_LD (Bitfield-Mask: 0x07)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_D1_LD_Pos (28UL)          /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: D1_LD (Bit 28)             */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG0_D1_LD_Msk (0x70000000UL)  /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG0: D1_LD (Bitfield-Mask: 0x07)*/
/* =============================================  UDB_UDBPAIR_UDBSNG.DPATH_CFG1  ============================================= */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_SI_MUX_Pos (0UL)          /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: SI_MUX (Bit 0)             */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_SI_MUX_Msk (0x7UL)        /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: SI_MUX (Bitfield-Mask: 0x07)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_CI_MUX_Pos (4UL)          /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: CI_MUX (Bit 4)             */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_CI_MUX_Msk (0x70UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: CI_MUX (Bitfield-Mask: 0x07)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT0_Pos (8UL)            /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT0 (Bit 8)               */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT0_Msk (0xf00UL)        /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT0 (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT1_Pos (12UL)           /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT1 (Bit 12)              */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT1_Msk (0xf000UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT1 (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT2_Pos (16UL)           /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT2 (Bit 16)              */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT2_Msk (0xf0000UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT2 (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT3_Pos (20UL)           /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT3 (Bit 20)              */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT3_Msk (0xf00000UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT3 (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT4_Pos (24UL)           /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT4 (Bit 24)              */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT4_Msk (0xf000000UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT4 (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT5_Pos (28UL)           /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT5 (Bit 28)              */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG1_OUT5_Msk (0xf0000000UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG1: OUT5 (Bitfield-Mask: 0x0f) */
/* =============================================  UDB_UDBPAIR_UDBSNG.DPATH_CFG2  ============================================= */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG2_OUT_SYNC_Pos (0UL)        /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG2: OUT_SYNC (Bit 0)           */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG2_OUT_SYNC_Msk (0x3fUL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG2: OUT_SYNC (Bitfield-Mask: 0x3f)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG2_AMASK_Pos (8UL)           /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG2: AMASK (Bit 8)              */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG2_AMASK_Msk (0xff00UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG2: AMASK (Bitfield-Mask: 0xff)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG2_CMASK0_Pos (16UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG2: CMASK0 (Bit 16)            */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG2_CMASK0_Msk (0xff0000UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG2: CMASK0 (Bitfield-Mask: 0xff)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG2_CMASK1_Pos (24UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG2: CMASK1 (Bit 24)            */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG2_CMASK1_Msk (0xff000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG2: CMASK1 (Bitfield-Mask: 0xff)*/
/* =============================================  UDB_UDBPAIR_UDBSNG.DPATH_CFG3  ============================================= */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_SI_SELA_Pos (0UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: SI_SELA (Bit 0)            */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_SI_SELA_Msk (0x3UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: SI_SELA (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_SI_SELB_Pos (2UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: SI_SELB (Bit 2)            */
