ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_SI_SELB_Msk (0xcUL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: SI_SELB (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_DEF_SI_Pos (4UL)          /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: DEF_SI (Bit 4)             */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_DEF_SI_Msk (0x10UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: DEF_SI (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_AMASK_EN_Pos (5UL)        /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: AMASK_EN (Bit 5)           */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_AMASK_EN_Msk (0x20UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: AMASK_EN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CMASK0_EN_Pos (6UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CMASK0_EN (Bit 6)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CMASK0_EN_Msk (0x40UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CMASK0_EN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CMASK1_EN_Pos (7UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CMASK1_EN (Bit 7)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CMASK1_EN_Msk (0x80UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CMASK1_EN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CI_SELA_Pos (8UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CI_SELA (Bit 8)            */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CI_SELA_Msk (0x300UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CI_SELA (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CI_SELB_Pos (10UL)        /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CI_SELB (Bit 10)           */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CI_SELB_Msk (0xc00UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CI_SELB (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CMP_SELA_Pos (12UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CMP_SELA (Bit 12)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CMP_SELA_Msk (0x3000UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CMP_SELA (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CMP_SELB_Pos (14UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CMP_SELB (Bit 14)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CMP_SELB_Msk (0xc000UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CMP_SELB (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CHAIN0_Pos (16UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CHAIN0 (Bit 16)            */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CHAIN0_Msk (0x10000UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CHAIN0 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CHAIN1_Pos (17UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CHAIN1 (Bit 17)            */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CHAIN1_Msk (0x20000UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CHAIN1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CHAIN_FB_Pos (18UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CHAIN_FB (Bit 18)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CHAIN_FB_Msk (0x40000UL)  /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CHAIN_FB (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CHAIN_CMSB_Pos (19UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CHAIN_CMSB (Bit 19)        */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_CHAIN_CMSB_Msk (0x80000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: CHAIN_CMSB (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_MSB_SEL_Pos (20UL)        /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: MSB_SEL (Bit 20)           */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_MSB_SEL_Msk (0x700000UL)  /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: MSB_SEL (Bitfield-Mask: 0x07)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_MSB_EN_Pos (23UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: MSB_EN (Bit 23)            */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_MSB_EN_Msk (0x800000UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: MSB_EN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_F0_INSEL_Pos (24UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: F0_INSEL (Bit 24)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_F0_INSEL_Msk (0x3000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: F0_INSEL (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_F1_INSEL_Pos (26UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: F1_INSEL (Bit 26)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_F1_INSEL_Msk (0xc000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: F1_INSEL (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_MSB_SI_Pos (28UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: MSB_SI (Bit 28)            */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_MSB_SI_Msk (0x10000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: MSB_SI (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_PI_DYN_Pos (29UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: PI_DYN (Bit 29)            */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_PI_DYN_Msk (0x20000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: PI_DYN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_SHIFT_SEL_Pos (30UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: SHIFT_SEL (Bit 30)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_SHIFT_SEL_Msk (0x40000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: SHIFT_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_PI_SEL_Pos (31UL)         /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: PI_SEL (Bit 31)            */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG3_PI_SEL_Msk (0x80000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG3: PI_SEL (Bitfield-Mask: 0x01)*/
/* =============================================  UDB_UDBPAIR_UDBSNG.DPATH_CFG4  ============================================= */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_EXT_CRCPRS_Pos (1UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: EXT_CRCPRS (Bit 1)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_EXT_CRCPRS_Msk (0x2UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: EXT_CRCPRS (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_FIFO_ASYNC_Pos (2UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: FIFO_ASYNC (Bit 2)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_FIFO_ASYNC_Msk (0x4UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: FIFO_ASYNC (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_FIFO_EDGE_Pos (3UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: FIFO_EDGE (Bit 3)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_FIFO_EDGE_Msk (0x8UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: FIFO_EDGE (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_FIFO_CAP_Pos (4UL)        /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: FIFO_CAP (Bit 4)           */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_FIFO_CAP_Msk (0x10UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: FIFO_CAP (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_FIFO_FAST_Pos (5UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: FIFO_FAST (Bit 5)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_FIFO_FAST_Msk (0x20UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: FIFO_FAST (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_F0_CK_INV_Pos (6UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: F0_CK_INV (Bit 6)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_F0_CK_INV_Msk (0x40UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: F0_CK_INV (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_F1_CK_INV_Pos (7UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: F1_CK_INV (Bit 7)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_F1_CK_INV_Msk (0x80UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: F1_CK_INV (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_F0_DYN_Pos (8UL)          /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: F0_DYN (Bit 8)             */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_F0_DYN_Msk (0x100UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: F0_DYN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_F1_DYN_Pos (9UL)          /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: F1_DYN (Bit 9)             */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_F1_DYN_Msk (0x200UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: F1_DYN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_FIFO_ADD_SYNC_Pos (12UL)  /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: FIFO_ADD_SYNC (Bit 12)     */
#define UDB_UDBPAIR_UDBSNG_DPATH_CFG4_FIFO_ADD_SYNC_Msk (0x1000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_CFG4: FIFO_ADD_SYNC (Bitfield-Mask: 0x01)*/
/* ==============================================  UDB_UDBPAIR_UDBSNG.SC_CFG0  =============================================== */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_CTL_MD0_Pos (0UL)            /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: CTL_MD0 (Bit 0)               */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_CTL_MD0_Msk (0xffUL)         /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: CTL_MD0 (Bitfield-Mask: 0xff) */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_CTL_MD1_Pos (8UL)            /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: CTL_MD1 (Bit 8)               */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_CTL_MD1_Msk (0xff00UL)       /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: CTL_MD1 (Bitfield-Mask: 0xff) */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_STAT_MD_Pos (16UL)           /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: STAT_MD (Bit 16)              */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_STAT_MD_Msk (0xff0000UL)     /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: STAT_MD (Bitfield-Mask: 0xff) */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_SC_OUT_CTL_Pos (24UL)        /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: SC_OUT_CTL (Bit 24)           */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_SC_OUT_CTL_Msk (0x3000000UL) /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: SC_OUT_CTL (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_SC_INT_MD_Pos (26UL)         /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: SC_INT_MD (Bit 26)            */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_SC_INT_MD_Msk (0x4000000UL)  /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: SC_INT_MD (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_SC_SYNC_MD_Pos (27UL)        /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: SC_SYNC_MD (Bit 27)           */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_SC_SYNC_MD_Msk (0x8000000UL) /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: SC_SYNC_MD (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_SC_EXT_RES_Pos (28UL)        /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: SC_EXT_RES (Bit 28)           */
#define UDB_UDBPAIR_UDBSNG_SC_CFG0_SC_EXT_RES_Msk (0x10000000UL) /*!< UDB_UDBPAIR_UDBSNG SC_CFG0: SC_EXT_RES (Bitfield-Mask: 0x01)*/
/* ==============================================  UDB_UDBPAIR_UDBSNG.SC_CFG1  =============================================== */
#define UDB_UDBPAIR_UDBSNG_SC_CFG1_CNT_LD_SEL_Pos (0UL)         /*!< UDB_UDBPAIR_UDBSNG SC_CFG1: CNT_LD_SEL (Bit 0)            */
#define UDB_UDBPAIR_UDBSNG_SC_CFG1_CNT_LD_SEL_Msk (0x3UL)       /*!< UDB_UDBPAIR_UDBSNG SC_CFG1: CNT_LD_SEL (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_SC_CFG1_CNT_EN_SEL_Pos (2UL)         /*!< UDB_UDBPAIR_UDBSNG SC_CFG1: CNT_EN_SEL (Bit 2)            */
#define UDB_UDBPAIR_UDBSNG_SC_CFG1_CNT_EN_SEL_Msk (0xcUL)       /*!< UDB_UDBPAIR_UDBSNG SC_CFG1: CNT_EN_SEL (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_SC_CFG1_ROUTE_LD_Pos (4UL)           /*!< UDB_UDBPAIR_UDBSNG SC_CFG1: ROUTE_LD (Bit 4)              */
#define UDB_UDBPAIR_UDBSNG_SC_CFG1_ROUTE_LD_Msk (0x10UL)        /*!< UDB_UDBPAIR_UDBSNG SC_CFG1: ROUTE_LD (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_SC_CFG1_ROUTE_EN_Pos (5UL)           /*!< UDB_UDBPAIR_UDBSNG SC_CFG1: ROUTE_EN (Bit 5)              */
#define UDB_UDBPAIR_UDBSNG_SC_CFG1_ROUTE_EN_Msk (0x20UL)        /*!< UDB_UDBPAIR_UDBSNG SC_CFG1: ROUTE_EN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_SC_CFG1_ALT_CNT_Pos (6UL)            /*!< UDB_UDBPAIR_UDBSNG SC_CFG1: ALT_CNT (Bit 6)               */
#define UDB_UDBPAIR_UDBSNG_SC_CFG1_ALT_CNT_Msk (0x40UL)         /*!< UDB_UDBPAIR_UDBSNG SC_CFG1: ALT_CNT (Bitfield-Mask: 0x01) */
/* ==============================================  UDB_UDBPAIR_UDBSNG.RC_CFG0  =============================================== */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_EN_SEL_Pos (0UL)     /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_EN_SEL (Bit 0)        */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_EN_SEL_Msk (0x3UL)   /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_EN_SEL (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_EN_MODE_Pos (2UL)    /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_EN_MODE (Bit 2)       */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_EN_MODE_Msk (0xcUL)  /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_EN_MODE (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_EN_INV_Pos (4UL)     /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_EN_INV (Bit 4)        */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_EN_INV_Msk (0x10UL)  /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_EN_INV (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_INV_Pos (5UL)        /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_INV (Bit 5)           */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_INV_Msk (0x20UL)     /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_INV (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_RES_SEL0_OR_FRES_Pos (6UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_RES_SEL0_OR_FRES (Bit 6)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_RES_SEL0_OR_FRES_Msk (0x40UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_RES_SEL0_OR_FRES (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_RES_SEL1_Pos (7UL)   /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_RES_SEL1 (Bit 7)      */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD0_RC_RES_SEL1_Msk (0x80UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD0_RC_RES_SEL1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD1_RC_EN_SEL_Pos (8UL)     /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD1_RC_EN_SEL (Bit 8)        */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD1_RC_EN_SEL_Msk (0x300UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD1_RC_EN_SEL (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD1_RC_EN_MODE_Pos (10UL)   /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD1_RC_EN_MODE (Bit 10)      */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD1_RC_EN_MODE_Msk (0xc00UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD1_RC_EN_MODE (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD1_RC_EN_INV_Pos (12UL)    /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD1_RC_EN_INV (Bit 12)       */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD1_RC_EN_INV_Msk (0x1000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD1_RC_EN_INV (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD1_RC_INV_Pos (13UL)       /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD1_RC_INV (Bit 13)          */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD1_RC_INV_Msk (0x2000UL)   /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD1_RC_INV (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD1_RC_RES_SEL0_OR_FRES_Pos (14UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD1_RC_RES_SEL0_OR_FRES (Bit 14)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_PLD1_RC_RES_SEL0_OR_FRES_Msk (0x4000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: PLD1_RC_RES_SEL0_OR_FRES (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_EN_SEL_Pos (16UL)      /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_EN_SEL (Bit 16)         */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_EN_SEL_Msk (0x30000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_EN_SEL (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_EN_MODE_Pos (18UL)     /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_EN_MODE (Bit 18)        */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_EN_MODE_Msk (0xc0000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_EN_MODE (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_EN_INV_Pos (20UL)      /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_EN_INV (Bit 20)         */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_EN_INV_Msk (0x100000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_EN_INV (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_INV_Pos (21UL)         /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_INV (Bit 21)            */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_INV_Msk (0x200000UL)   /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_INV (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_RES_SEL0_OR_FRES_Pos (22UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_RES_SEL0_OR_FRES (Bit 22)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_RES_SEL0_OR_FRES_Msk (0x400000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_RES_SEL0_OR_FRES (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_RES_SEL1_Pos (23UL)    /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_RES_SEL1 (Bit 23)       */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_DP_RC_RES_SEL1_Msk (0x800000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: DP_RC_RES_SEL1 (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_EN_SEL_Pos (24UL)      /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_EN_SEL (Bit 24)         */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_EN_SEL_Msk (0x3000000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_EN_SEL (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_EN_MODE_Pos (26UL)     /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_EN_MODE (Bit 26)        */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_EN_MODE_Msk (0xc000000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_EN_MODE (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_EN_INV_Pos (28UL)      /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_EN_INV (Bit 28)         */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_EN_INV_Msk (0x10000000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_EN_INV (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_INV_Pos (29UL)         /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_INV (Bit 29)            */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_INV_Msk (0x20000000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_INV (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_RES_SEL0_OR_FRES_Pos (30UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_RES_SEL0_OR_FRES (Bit 30)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_RES_SEL0_OR_FRES_Msk (0x40000000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_RES_SEL0_OR_FRES (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_RES_SEL1_Pos (31UL)    /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_RES_SEL1 (Bit 31)       */
#define UDB_UDBPAIR_UDBSNG_RC_CFG0_SC_RC_RES_SEL1_Msk (0x80000000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG0: SC_RC_RES_SEL1 (Bitfield-Mask: 0x01)*/
/* ==============================================  UDB_UDBPAIR_UDBSNG.RC_CFG1  =============================================== */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_PLD0_CK_SEL_Pos (0UL)        /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: PLD0_CK_SEL (Bit 0)           */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_PLD0_CK_SEL_Msk (0xfUL)      /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: PLD0_CK_SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_PLD1_CK_SEL_Pos (4UL)        /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: PLD1_CK_SEL (Bit 4)           */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_PLD1_CK_SEL_Msk (0xf0UL)     /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: PLD1_CK_SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_DP_CK_SEL_Pos (8UL)          /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: DP_CK_SEL (Bit 8)             */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_DP_CK_SEL_Msk (0xf00UL)      /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: DP_CK_SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_SC_CK_SEL_Pos (12UL)         /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: SC_CK_SEL (Bit 12)            */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_SC_CK_SEL_Msk (0xf000UL)     /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: SC_CK_SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_RES_SEL_Pos (16UL)           /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: RES_SEL (Bit 16)              */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_RES_SEL_Msk (0x30000UL)      /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: RES_SEL (Bitfield-Mask: 0x03) */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_RES_POL_Pos (18UL)           /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: RES_POL (Bit 18)              */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_RES_POL_Msk (0x40000UL)      /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: RES_POL (Bitfield-Mask: 0x01) */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_EN_RES_CNTCTL_Pos (19UL)     /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: EN_RES_CNTCTL (Bit 19)        */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_EN_RES_CNTCTL_Msk (0x80000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: EN_RES_CNTCTL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_DP_RES_POL_Pos (22UL)        /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: DP_RES_POL (Bit 22)           */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_DP_RES_POL_Msk (0x400000UL)  /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: DP_RES_POL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_SC_RES_POL_Pos (23UL)        /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: SC_RES_POL (Bit 23)           */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_SC_RES_POL_Msk (0x800000UL)  /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: SC_RES_POL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_ALT_RES_Pos (24UL)           /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: ALT_RES (Bit 24)              */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_ALT_RES_Msk (0x1000000UL)    /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: ALT_RES (Bitfield-Mask: 0x01) */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_EXT_SYNC_Pos (25UL)          /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: EXT_SYNC (Bit 25)             */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_EXT_SYNC_Msk (0x2000000UL)   /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: EXT_SYNC (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_EN_RES_STAT_Pos (26UL)       /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: EN_RES_STAT (Bit 26)          */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_EN_RES_STAT_Msk (0x4000000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: EN_RES_STAT (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_EN_RES_DP_Pos (27UL)         /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: EN_RES_DP (Bit 27)            */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_EN_RES_DP_Msk (0x8000000UL)  /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: EN_RES_DP (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_EXT_CK_SEL_Pos (28UL)        /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: EXT_CK_SEL (Bit 28)           */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_EXT_CK_SEL_Msk (0x30000000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: EXT_CK_SEL (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_PLD0_RES_POL_Pos (30UL)      /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: PLD0_RES_POL (Bit 30)         */
#define UDB_UDBPAIR_UDBSNG_RC_CFG1_PLD0_RES_POL_Msk (0x40000000UL) /*!< UDB_UDBPAIR_UDBSNG RC_CFG1: PLD0_RES_POL (Bitfield-Mask: 0x01)*/
/* =============================================  UDB_UDBPAIR_UDBSNG.DPATH_OPC  ============================================== */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_CMP_SEL_Pos (0UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_CMP_SEL (Bit 0)        */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_CMP_SEL_Msk (0x1UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_CMP_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_SI_SEL_Pos (1UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_SI_SEL (Bit 1)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_SI_SEL_Msk (0x2UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_SI_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_CI_SEL_Pos (2UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_CI_SEL (Bit 2)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_CI_SEL_Msk (0x4UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_CI_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_CFB_EN_Pos (3UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_CFB_EN (Bit 3)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_CFB_EN_Msk (0x8UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_CFB_EN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_A1_WR_SRC_Pos (4UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_A1_WR_SRC (Bit 4)      */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_A1_WR_SRC_Msk (0x30UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_A1_WR_SRC (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_A0_WR_SRC_Pos (6UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_A0_WR_SRC (Bit 6)      */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_A0_WR_SRC_Msk (0xc0UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_A0_WR_SRC (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_SHIFT_Pos (8UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_SHIFT (Bit 8)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_SHIFT_Msk (0x300UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_SHIFT (Bitfield-Mask: 0x03)*/
