ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_SRC_B_Pos (10UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_SRC_B (Bit 10)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_SRC_B_Msk (0xc00UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_SRC_B (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_SRC_A_Pos (12UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_SRC_A (Bit 12)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_SRC_A_Msk (0x1000UL)  /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_SRC_A (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_FUNC_Pos (13UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_FUNC (Bit 13)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC0_FUNC_Msk (0xe000UL)   /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC0_FUNC (Bitfield-Mask: 0x07)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_CMP_SEL_Pos (16UL)    /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_CMP_SEL (Bit 16)       */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_CMP_SEL_Msk (0x10000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_CMP_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_SI_SEL_Pos (17UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_SI_SEL (Bit 17)        */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_SI_SEL_Msk (0x20000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_SI_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_CI_SEL_Pos (18UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_CI_SEL (Bit 18)        */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_CI_SEL_Msk (0x40000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_CI_SEL (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_CFB_EN_Pos (19UL)     /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_CFB_EN (Bit 19)        */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_CFB_EN_Msk (0x80000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_CFB_EN (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_A1_WR_SRC_Pos (20UL)  /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_A1_WR_SRC (Bit 20)     */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_A1_WR_SRC_Msk (0x300000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_A1_WR_SRC (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_A0_WR_SRC_Pos (22UL)  /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_A0_WR_SRC (Bit 22)     */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_A0_WR_SRC_Msk (0xc00000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_A0_WR_SRC (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_SHIFT_Pos (24UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_SHIFT (Bit 24)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_SHIFT_Msk (0x3000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_SHIFT (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_SRC_B_Pos (26UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_SRC_B (Bit 26)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_SRC_B_Msk (0xc000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_SRC_B (Bitfield-Mask: 0x03)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_SRC_A_Pos (28UL)      /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_SRC_A (Bit 28)         */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_SRC_A_Msk (0x10000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_SRC_A (Bitfield-Mask: 0x01)*/
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_FUNC_Pos (29UL)       /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_FUNC (Bit 29)          */
#define UDB_UDBPAIR_UDBSNG_DPATH_OPC_OPC1_FUNC_Msk (0xe0000000UL) /*!< UDB_UDBPAIR_UDBSNG DPATH_OPC: OPC1_FUNC (Bitfield-Mask: 0x07)*/


/* ==============================================  UDB_UDBPAIR_ROUTE.TOP_V_BOT  ============================================== */
#define UDB_UDBPAIR_ROUTE_TOP_V_BOT_TOP_V_BOT_Pos (0UL)         /*!< UDB_UDBPAIR_ROUTE TOP_V_BOT: TOP_V_BOT (Bit 0)            */
#define UDB_UDBPAIR_ROUTE_TOP_V_BOT_TOP_V_BOT_Msk (0xffffffffUL) /*!< UDB_UDBPAIR_ROUTE TOP_V_BOT: TOP_V_BOT (Bitfield-Mask: 0xffffffff)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LVI1_V_2  =============================================== */
#define UDB_UDBPAIR_ROUTE_LVI1_V_2_LVI1_V_2_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE LVI1_V_2: LVI1_V_2 (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_LVI1_V_2_LVI1_V_2_Msk (0xffffffffUL)  /*!< UDB_UDBPAIR_ROUTE LVI1_V_2: LVI1_V_2 (Bitfield-Mask: 0xffffffff)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.RVI1_V_2  =============================================== */
#define UDB_UDBPAIR_ROUTE_RVI1_V_2_RVI1_V_2_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE RVI1_V_2: RVI1_V_2 (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_RVI1_V_2_RVI1_V_2_Msk (0xffffffffUL)  /*!< UDB_UDBPAIR_ROUTE RVI1_V_2: RVI1_V_2 (Bitfield-Mask: 0xffffffff)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.TUI_CFG0  =============================================== */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI0SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI0SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI0SEL_Msk (0xfUL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI0SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI1SEL_Pos (4UL)            /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI1SEL (Bit 4)               */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI1SEL_Msk (0xf0UL)         /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI1SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI2SEL_Pos (8UL)            /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI2SEL (Bit 8)               */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI2SEL_Msk (0xf00UL)        /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI2SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI3SEL_Pos (12UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI3SEL (Bit 12)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI3SEL_Msk (0xf000UL)       /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI3SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI4SEL_Pos (16UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI4SEL (Bit 16)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI4SEL_Msk (0xf0000UL)      /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI4SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI5SEL_Pos (20UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI5SEL (Bit 20)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI5SEL_Msk (0xf00000UL)     /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI5SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI6SEL_Pos (24UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI6SEL (Bit 24)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI6SEL_Msk (0xf000000UL)    /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI6SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI7SEL_Pos (28UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI7SEL (Bit 28)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG0_TUI7SEL_Msk (0xf0000000UL)   /*!< UDB_UDBPAIR_ROUTE TUI_CFG0: TUI7SEL (Bitfield-Mask: 0x0f) */
/* ==============================================  UDB_UDBPAIR_ROUTE.TUI_CFG1  =============================================== */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI8SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI8SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI8SEL_Msk (0xfUL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI8SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI9SEL_Pos (4UL)            /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI9SEL (Bit 4)               */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI9SEL_Msk (0xf0UL)         /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI9SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI10SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI10SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI10SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI10SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI11SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI11SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI11SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI11SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI12SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI12SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI12SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI12SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI13SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI13SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI13SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI13SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI14SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI14SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI14SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI14SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI15SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI15SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG1_TUI15SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE TUI_CFG1: TUI15SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.TUI_CFG2  =============================================== */
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI16SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI16SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI16SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI16SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI17SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI17SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI17SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI17SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI18SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI18SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI18SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI18SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI19SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI19SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI19SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI19SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI20SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI20SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI20SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI20SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI21SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI21SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI21SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI21SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI22SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI22SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI22SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI22SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI23SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI23SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG2_TUI23SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE TUI_CFG2: TUI23SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.TUI_CFG3  =============================================== */
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI24SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI24SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI24SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI24SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI25SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI25SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI25SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI25SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI26SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI26SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI26SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI26SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI27SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI27SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI27SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI27SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI28SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI28SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI28SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI28SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI29SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI29SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI29SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI29SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI30SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI30SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI30SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI30SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI31SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI31SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG3_TUI31SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE TUI_CFG3: TUI31SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.TUI_CFG4  =============================================== */
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI32SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI32SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI32SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI32SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI33SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI33SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI33SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI33SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI34SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI34SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI34SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI34SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI35SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI35SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI35SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI35SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI36SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI36SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI36SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI36SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI37SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI37SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI37SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI37SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI38SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI38SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI38SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI38SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI39SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI39SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_TUI_CFG4_TUI39SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE TUI_CFG4: TUI39SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.TUI_CFG5  =============================================== */
#define UDB_UDBPAIR_ROUTE_TUI_CFG5_TUI40SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG5: TUI40SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG5_TUI40SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE TUI_CFG5: TUI40SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_TUI_CFG5_TUI41SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE TUI_CFG5: TUI41SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_TUI_CFG5_TUI41SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE TUI_CFG5: TUI41SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.BUI_CFG0  =============================================== */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI0SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI0SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI0SEL_Msk (0xfUL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI0SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI1SEL_Pos (4UL)            /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI1SEL (Bit 4)               */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI1SEL_Msk (0xf0UL)         /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI1SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI2SEL_Pos (8UL)            /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI2SEL (Bit 8)               */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI2SEL_Msk (0xf00UL)        /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI2SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI3SEL_Pos (12UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI3SEL (Bit 12)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI3SEL_Msk (0xf000UL)       /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI3SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI4SEL_Pos (16UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI4SEL (Bit 16)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI4SEL_Msk (0xf0000UL)      /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI4SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI5SEL_Pos (20UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI5SEL (Bit 20)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI5SEL_Msk (0xf00000UL)     /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI5SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI6SEL_Pos (24UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI6SEL (Bit 24)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI6SEL_Msk (0xf000000UL)    /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI6SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI7SEL_Pos (28UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI7SEL (Bit 28)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG0_BUI7SEL_Msk (0xf0000000UL)   /*!< UDB_UDBPAIR_ROUTE BUI_CFG0: BUI7SEL (Bitfield-Mask: 0x0f) */
/* ==============================================  UDB_UDBPAIR_ROUTE.BUI_CFG1  =============================================== */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI8SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI8SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI8SEL_Msk (0xfUL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI8SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI9SEL_Pos (4UL)            /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI9SEL (Bit 4)               */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI9SEL_Msk (0xf0UL)         /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI9SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI10SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI10SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI10SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI10SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI11SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI11SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI11SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI11SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI12SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI12SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI12SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI12SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI13SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI13SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI13SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI13SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI14SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI14SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI14SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI14SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI15SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI15SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG1_BUI15SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE BUI_CFG1: BUI15SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.BUI_CFG2  =============================================== */
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI16SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI16SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI16SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI16SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI17SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI17SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI17SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI17SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI18SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI18SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI18SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI18SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI19SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI19SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI19SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI19SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI20SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI20SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI20SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI20SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI21SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI21SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI21SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI21SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI22SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI22SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI22SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI22SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI23SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI23SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG2_BUI23SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE BUI_CFG2: BUI23SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.BUI_CFG3  =============================================== */
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI24SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI24SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI24SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI24SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI25SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI25SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI25SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI25SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI26SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI26SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI26SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI26SEL (Bitfield-Mask: 0x0f)*/
