ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI27SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI27SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI27SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI27SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI28SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI28SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI28SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI28SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI29SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI29SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI29SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI29SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI30SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI30SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI30SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI30SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI31SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI31SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG3_BUI31SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE BUI_CFG3: BUI31SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.BUI_CFG4  =============================================== */
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI32SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI32SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI32SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI32SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI33SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI33SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI33SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI33SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI34SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI34SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI34SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI34SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI35SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI35SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI35SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI35SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI36SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI36SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI36SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI36SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI37SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI37SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI37SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI37SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI38SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI38SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI38SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI38SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI39SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI39SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_BUI_CFG4_BUI39SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE BUI_CFG4: BUI39SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.BUI_CFG5  =============================================== */
#define UDB_UDBPAIR_ROUTE_BUI_CFG5_BUI40SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG5: BUI40SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG5_BUI40SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE BUI_CFG5: BUI40SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_BUI_CFG5_BUI41SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE BUI_CFG5: BUI41SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_BUI_CFG5_BUI41SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE BUI_CFG5: BUI41SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.RVO_CFG0  =============================================== */
#define UDB_UDBPAIR_ROUTE_RVO_CFG0_RVO0SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE RVO_CFG0: RVO0SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_RVO_CFG0_RVO0SEL_Msk (0x1fUL)         /*!< UDB_UDBPAIR_ROUTE RVO_CFG0: RVO0SEL (Bitfield-Mask: 0x1f) */
#define UDB_UDBPAIR_ROUTE_RVO_CFG0_RVO1SEL_Pos (8UL)            /*!< UDB_UDBPAIR_ROUTE RVO_CFG0: RVO1SEL (Bit 8)               */
#define UDB_UDBPAIR_ROUTE_RVO_CFG0_RVO1SEL_Msk (0x1f00UL)       /*!< UDB_UDBPAIR_ROUTE RVO_CFG0: RVO1SEL (Bitfield-Mask: 0x1f) */
#define UDB_UDBPAIR_ROUTE_RVO_CFG0_RVO2SEL_Pos (16UL)           /*!< UDB_UDBPAIR_ROUTE RVO_CFG0: RVO2SEL (Bit 16)              */
#define UDB_UDBPAIR_ROUTE_RVO_CFG0_RVO2SEL_Msk (0x1f0000UL)     /*!< UDB_UDBPAIR_ROUTE RVO_CFG0: RVO2SEL (Bitfield-Mask: 0x1f) */
#define UDB_UDBPAIR_ROUTE_RVO_CFG0_RVO3SEL_Pos (24UL)           /*!< UDB_UDBPAIR_ROUTE RVO_CFG0: RVO3SEL (Bit 24)              */
#define UDB_UDBPAIR_ROUTE_RVO_CFG0_RVO3SEL_Msk (0x1f000000UL)   /*!< UDB_UDBPAIR_ROUTE RVO_CFG0: RVO3SEL (Bitfield-Mask: 0x1f) */
/* ==============================================  UDB_UDBPAIR_ROUTE.RVO_CFG1  =============================================== */
#define UDB_UDBPAIR_ROUTE_RVO_CFG1_RVO4SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE RVO_CFG1: RVO4SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_RVO_CFG1_RVO4SEL_Msk (0x1fUL)         /*!< UDB_UDBPAIR_ROUTE RVO_CFG1: RVO4SEL (Bitfield-Mask: 0x1f) */
#define UDB_UDBPAIR_ROUTE_RVO_CFG1_RVO5SEL_Pos (8UL)            /*!< UDB_UDBPAIR_ROUTE RVO_CFG1: RVO5SEL (Bit 8)               */
#define UDB_UDBPAIR_ROUTE_RVO_CFG1_RVO5SEL_Msk (0x1f00UL)       /*!< UDB_UDBPAIR_ROUTE RVO_CFG1: RVO5SEL (Bitfield-Mask: 0x1f) */
#define UDB_UDBPAIR_ROUTE_RVO_CFG1_RVO6SEL_Pos (16UL)           /*!< UDB_UDBPAIR_ROUTE RVO_CFG1: RVO6SEL (Bit 16)              */
#define UDB_UDBPAIR_ROUTE_RVO_CFG1_RVO6SEL_Msk (0x1f0000UL)     /*!< UDB_UDBPAIR_ROUTE RVO_CFG1: RVO6SEL (Bitfield-Mask: 0x1f) */
#define UDB_UDBPAIR_ROUTE_RVO_CFG1_RVO7SEL_Pos (24UL)           /*!< UDB_UDBPAIR_ROUTE RVO_CFG1: RVO7SEL (Bit 24)              */
#define UDB_UDBPAIR_ROUTE_RVO_CFG1_RVO7SEL_Msk (0x1f000000UL)   /*!< UDB_UDBPAIR_ROUTE RVO_CFG1: RVO7SEL (Bitfield-Mask: 0x1f) */
/* ==============================================  UDB_UDBPAIR_ROUTE.RVO_CFG2  =============================================== */
#define UDB_UDBPAIR_ROUTE_RVO_CFG2_RVO8SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE RVO_CFG2: RVO8SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_RVO_CFG2_RVO8SEL_Msk (0x1fUL)         /*!< UDB_UDBPAIR_ROUTE RVO_CFG2: RVO8SEL (Bitfield-Mask: 0x1f) */
#define UDB_UDBPAIR_ROUTE_RVO_CFG2_RVO9SEL_Pos (8UL)            /*!< UDB_UDBPAIR_ROUTE RVO_CFG2: RVO9SEL (Bit 8)               */
#define UDB_UDBPAIR_ROUTE_RVO_CFG2_RVO9SEL_Msk (0x1f00UL)       /*!< UDB_UDBPAIR_ROUTE RVO_CFG2: RVO9SEL (Bitfield-Mask: 0x1f) */
#define UDB_UDBPAIR_ROUTE_RVO_CFG2_RVO10SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE RVO_CFG2: RVO10SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_RVO_CFG2_RVO10SEL_Msk (0x1f0000UL)    /*!< UDB_UDBPAIR_ROUTE RVO_CFG2: RVO10SEL (Bitfield-Mask: 0x1f)*/
#define UDB_UDBPAIR_ROUTE_RVO_CFG2_RVO11SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE RVO_CFG2: RVO11SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_RVO_CFG2_RVO11SEL_Msk (0x1f000000UL)  /*!< UDB_UDBPAIR_ROUTE RVO_CFG2: RVO11SEL (Bitfield-Mask: 0x1f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.RVO_CFG3  =============================================== */
#define UDB_UDBPAIR_ROUTE_RVO_CFG3_RVO12SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE RVO_CFG3: RVO12SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_RVO_CFG3_RVO12SEL_Msk (0x1fUL)        /*!< UDB_UDBPAIR_ROUTE RVO_CFG3: RVO12SEL (Bitfield-Mask: 0x1f)*/
#define UDB_UDBPAIR_ROUTE_RVO_CFG3_RVO13SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE RVO_CFG3: RVO13SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_RVO_CFG3_RVO13SEL_Msk (0x1f00UL)      /*!< UDB_UDBPAIR_ROUTE RVO_CFG3: RVO13SEL (Bitfield-Mask: 0x1f)*/
#define UDB_UDBPAIR_ROUTE_RVO_CFG3_RVO14SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE RVO_CFG3: RVO14SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_RVO_CFG3_RVO14SEL_Msk (0x1f0000UL)    /*!< UDB_UDBPAIR_ROUTE RVO_CFG3: RVO14SEL (Bitfield-Mask: 0x1f)*/
#define UDB_UDBPAIR_ROUTE_RVO_CFG3_RVO15SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE RVO_CFG3: RVO15SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_RVO_CFG3_RVO15SEL_Msk (0x1f000000UL)  /*!< UDB_UDBPAIR_ROUTE RVO_CFG3: RVO15SEL (Bitfield-Mask: 0x1f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LVO_CFG0  =============================================== */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO0SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO0SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO0SEL_Msk (0xfUL)          /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO0SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO1SEL_Pos (4UL)            /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO1SEL (Bit 4)               */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO1SEL_Msk (0xf0UL)         /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO1SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO2SEL_Pos (8UL)            /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO2SEL (Bit 8)               */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO2SEL_Msk (0xf00UL)        /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO2SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO3SEL_Pos (12UL)           /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO3SEL (Bit 12)              */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO3SEL_Msk (0xf000UL)       /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO3SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO4SEL_Pos (16UL)           /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO4SEL (Bit 16)              */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO4SEL_Msk (0xf0000UL)      /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO4SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO5SEL_Pos (20UL)           /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO5SEL (Bit 20)              */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO5SEL_Msk (0xf00000UL)     /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO5SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO6SEL_Pos (24UL)           /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO6SEL (Bit 24)              */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO6SEL_Msk (0xf000000UL)    /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO6SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO7SEL_Pos (28UL)           /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO7SEL (Bit 28)              */
#define UDB_UDBPAIR_ROUTE_LVO_CFG0_LVO7SEL_Msk (0xf0000000UL)   /*!< UDB_UDBPAIR_ROUTE LVO_CFG0: LVO7SEL (Bitfield-Mask: 0x0f) */
/* ==============================================  UDB_UDBPAIR_ROUTE.LVO_CFG1  =============================================== */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO8SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO8SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO8SEL_Msk (0xfUL)          /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO8SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO9SEL_Pos (4UL)            /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO9SEL (Bit 4)               */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO9SEL_Msk (0xf0UL)         /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO9SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO10SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO10SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO10SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO10SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO11SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO11SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO11SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO11SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO12SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO12SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO12SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO12SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO13SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO13SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO13SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO13SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO14SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO14SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO14SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO14SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO15SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO15SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_LVO_CFG1_LVO15SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE LVO_CFG1: LVO15SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.RHO_CFG0  =============================================== */
#define UDB_UDBPAIR_ROUTE_RHO_CFG0_RHOSEL_Pos (0UL)             /*!< UDB_UDBPAIR_ROUTE RHO_CFG0: RHOSEL (Bit 0)                */
#define UDB_UDBPAIR_ROUTE_RHO_CFG0_RHOSEL_Msk (0xffffffffUL)    /*!< UDB_UDBPAIR_ROUTE RHO_CFG0: RHOSEL (Bitfield-Mask: 0xffffffff)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.RHO_CFG1  =============================================== */
#define UDB_UDBPAIR_ROUTE_RHO_CFG1_RHOSEL_Pos (0UL)             /*!< UDB_UDBPAIR_ROUTE RHO_CFG1: RHOSEL (Bit 0)                */
#define UDB_UDBPAIR_ROUTE_RHO_CFG1_RHOSEL_Msk (0xffffffffUL)    /*!< UDB_UDBPAIR_ROUTE RHO_CFG1: RHOSEL (Bitfield-Mask: 0xffffffff)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.RHO_CFG2  =============================================== */
#define UDB_UDBPAIR_ROUTE_RHO_CFG2_RHOSEL_Pos (0UL)             /*!< UDB_UDBPAIR_ROUTE RHO_CFG2: RHOSEL (Bit 0)                */
#define UDB_UDBPAIR_ROUTE_RHO_CFG2_RHOSEL_Msk (0xffffffffUL)    /*!< UDB_UDBPAIR_ROUTE RHO_CFG2: RHOSEL (Bitfield-Mask: 0xffffffff)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG0  =============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO0SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO0SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO0SEL_Msk (0xfUL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO0SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO1SEL_Pos (4UL)            /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO1SEL (Bit 4)               */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO1SEL_Msk (0xf0UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO1SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO2SEL_Pos (8UL)            /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO2SEL (Bit 8)               */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO2SEL_Msk (0xf00UL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO2SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO3SEL_Pos (12UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO3SEL (Bit 12)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO3SEL_Msk (0xf000UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO3SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO4SEL_Pos (16UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO4SEL (Bit 16)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO4SEL_Msk (0xf0000UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO4SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO5SEL_Pos (20UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO5SEL (Bit 20)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO5SEL_Msk (0xf00000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO5SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO6SEL_Pos (24UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO6SEL (Bit 24)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO6SEL_Msk (0xf000000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO6SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO7SEL_Pos (28UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO7SEL (Bit 28)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG0_LHO7SEL_Msk (0xf0000000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG0: LHO7SEL (Bitfield-Mask: 0x0f) */
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG1  =============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO8SEL_Pos (0UL)            /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO8SEL (Bit 0)               */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO8SEL_Msk (0xfUL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO8SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO9SEL_Pos (4UL)            /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO9SEL (Bit 4)               */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO9SEL_Msk (0xf0UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO9SEL (Bitfield-Mask: 0x0f) */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO10SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO10SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO10SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO10SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO11SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO11SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO11SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO11SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO12SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO12SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO12SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO12SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO13SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO13SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO13SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO13SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO14SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO14SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO14SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO14SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO15SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO15SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG1_LHO15SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG1: LHO15SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG2  =============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO16SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO16SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO16SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO16SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO17SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO17SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO17SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO17SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO18SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO18SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO18SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO18SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO19SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO19SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO19SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO19SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO20SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO20SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO20SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO20SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO21SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO21SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO21SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO21SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO22SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO22SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO22SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO22SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO23SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO23SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG2_LHO23SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG2: LHO23SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG3  =============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO24SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO24SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO24SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO24SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO25SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO25SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO25SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO25SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO26SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO26SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO26SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO26SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO27SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO27SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO27SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO27SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO28SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO28SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO28SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO28SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO29SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO29SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO29SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO29SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO30SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO30SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO30SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO30SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO31SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO31SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG3_LHO31SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG3: LHO31SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG4  =============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO32SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO32SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO32SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO32SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO33SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO33SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO33SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO33SEL (Bitfield-Mask: 0x0f)*/
