ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO34SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO34SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO34SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO34SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO35SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO35SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO35SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO35SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO36SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO36SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO36SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO36SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO37SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO37SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO37SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO37SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO38SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO38SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO38SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO38SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO39SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO39SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG4_LHO39SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG4: LHO39SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG5  =============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO40SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO40SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO40SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO40SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO41SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO41SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO41SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO41SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO42SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO42SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO42SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO42SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO43SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO43SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO43SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO43SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO44SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO44SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO44SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO44SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO45SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO45SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO45SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO45SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO46SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO46SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO46SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO46SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO47SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO47SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG5_LHO47SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG5: LHO47SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG6  =============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO48SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO48SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO48SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO48SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO49SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO49SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO49SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO49SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO50SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO50SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO50SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO50SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO51SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO51SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO51SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO51SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO52SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO52SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO52SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO52SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO53SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO53SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO53SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO53SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO54SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO54SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO54SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO54SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO55SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO55SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG6_LHO55SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG6: LHO55SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG7  =============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO56SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO56SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO56SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO56SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO57SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO57SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO57SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO57SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO58SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO58SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO58SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO58SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO59SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO59SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO59SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO59SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO60SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO60SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO60SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO60SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO61SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO61SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO61SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO61SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO62SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO62SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO62SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO62SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO63SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO63SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG7_LHO63SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG7: LHO63SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG8  =============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO64SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO64SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO64SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO64SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO65SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO65SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO65SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO65SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO66SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO66SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO66SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO66SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO67SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO67SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO67SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO67SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO68SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO68SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO68SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO68SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO69SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO69SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO69SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO69SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO70SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO70SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO70SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO70SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO71SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO71SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG8_LHO71SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG8: LHO71SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG9  =============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO72SEL_Pos (0UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO72SEL (Bit 0)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO72SEL_Msk (0xfUL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO72SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO73SEL_Pos (4UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO73SEL (Bit 4)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO73SEL_Msk (0xf0UL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO73SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO74SEL_Pos (8UL)           /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO74SEL (Bit 8)              */
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO74SEL_Msk (0xf00UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO74SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO75SEL_Pos (12UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO75SEL (Bit 12)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO75SEL_Msk (0xf000UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO75SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO76SEL_Pos (16UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO76SEL (Bit 16)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO76SEL_Msk (0xf0000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO76SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO77SEL_Pos (20UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO77SEL (Bit 20)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO77SEL_Msk (0xf00000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO77SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO78SEL_Pos (24UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO78SEL (Bit 24)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO78SEL_Msk (0xf000000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO78SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO79SEL_Pos (28UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO79SEL (Bit 28)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG9_LHO79SEL_Msk (0xf0000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG9: LHO79SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG10  ============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO80SEL_Pos (0UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO80SEL (Bit 0)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO80SEL_Msk (0xfUL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO80SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO81SEL_Pos (4UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO81SEL (Bit 4)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO81SEL_Msk (0xf0UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO81SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO82SEL_Pos (8UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO82SEL (Bit 8)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO82SEL_Msk (0xf00UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO82SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO83SEL_Pos (12UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO83SEL (Bit 12)            */
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO83SEL_Msk (0xf000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO83SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO84SEL_Pos (16UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO84SEL (Bit 16)            */
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO84SEL_Msk (0xf0000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO84SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO85SEL_Pos (20UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO85SEL (Bit 20)            */
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO85SEL_Msk (0xf00000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO85SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO86SEL_Pos (24UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO86SEL (Bit 24)            */
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO86SEL_Msk (0xf000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO86SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO87SEL_Pos (28UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO87SEL (Bit 28)            */
#define UDB_UDBPAIR_ROUTE_LHO_CFG10_LHO87SEL_Msk (0xf0000000UL) /*!< UDB_UDBPAIR_ROUTE LHO_CFG10: LHO87SEL (Bitfield-Mask: 0x0f)*/
/* ==============================================  UDB_UDBPAIR_ROUTE.LHO_CFG11  ============================================== */
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO88SEL_Pos (0UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO88SEL (Bit 0)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO88SEL_Msk (0xfUL)        /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO88SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO89SEL_Pos (4UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO89SEL (Bit 4)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO89SEL_Msk (0xf0UL)       /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO89SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO90SEL_Pos (8UL)          /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO90SEL (Bit 8)             */
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO90SEL_Msk (0xf00UL)      /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO90SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO91SEL_Pos (12UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO91SEL (Bit 12)            */
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO91SEL_Msk (0xf000UL)     /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO91SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO92SEL_Pos (16UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO92SEL (Bit 16)            */
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO92SEL_Msk (0xf0000UL)    /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO92SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO93SEL_Pos (20UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO93SEL (Bit 20)            */
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO93SEL_Msk (0xf00000UL)   /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO93SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO94SEL_Pos (24UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO94SEL (Bit 24)            */
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO94SEL_Msk (0xf000000UL)  /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO94SEL (Bitfield-Mask: 0x0f)*/
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO95SEL_Pos (28UL)         /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO95SEL (Bit 28)            */
#define UDB_UDBPAIR_ROUTE_LHO_CFG11_LHO95SEL_Msk (0xf0000000UL) /*!< UDB_UDBPAIR_ROUTE LHO_CFG11: LHO95SEL (Bitfield-Mask: 0x0f)*/


