ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
/* ===================================================  UDB_DSI.LVI1_V_2  ==================================================== */
#define UDB_DSI_LVI1_V_2_LVI1_V_2_Pos     (0UL)                 /*!< UDB_DSI LVI1_V_2: LVI1_V_2 (Bit 0)                        */
#define UDB_DSI_LVI1_V_2_LVI1_V_2_Msk     (0xffffffffUL)        /*!< UDB_DSI LVI1_V_2: LVI1_V_2 (Bitfield-Mask: 0xffffffff)    */
/* ===================================================  UDB_DSI.RVI1_V_2  ==================================================== */
#define UDB_DSI_RVI1_V_2_RVI1_V_2_Pos     (0UL)                 /*!< UDB_DSI RVI1_V_2: RVI1_V_2 (Bit 0)                        */
#define UDB_DSI_RVI1_V_2_RVI1_V_2_Msk     (0xffffffffUL)        /*!< UDB_DSI RVI1_V_2: RVI1_V_2 (Bitfield-Mask: 0xffffffff)    */
/* ===================================================  UDB_DSI.DOP_CFG0  ==================================================== */
#define UDB_DSI_DOP_CFG0_DOP0SEL_Pos      (0UL)                 /*!< UDB_DSI DOP_CFG0: DOP0SEL (Bit 0)                         */
#define UDB_DSI_DOP_CFG0_DOP0SEL_Msk      (0x1fUL)              /*!< UDB_DSI DOP_CFG0: DOP0SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOP_CFG0_DOP1SEL_Pos      (8UL)                 /*!< UDB_DSI DOP_CFG0: DOP1SEL (Bit 8)                         */
#define UDB_DSI_DOP_CFG0_DOP1SEL_Msk      (0x1f00UL)            /*!< UDB_DSI DOP_CFG0: DOP1SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOP_CFG0_DOP2SEL_Pos      (16UL)                /*!< UDB_DSI DOP_CFG0: DOP2SEL (Bit 16)                        */
#define UDB_DSI_DOP_CFG0_DOP2SEL_Msk      (0x1f0000UL)          /*!< UDB_DSI DOP_CFG0: DOP2SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOP_CFG0_DOP3SEL_Pos      (24UL)                /*!< UDB_DSI DOP_CFG0: DOP3SEL (Bit 24)                        */
#define UDB_DSI_DOP_CFG0_DOP3SEL_Msk      (0x1f000000UL)        /*!< UDB_DSI DOP_CFG0: DOP3SEL (Bitfield-Mask: 0x1f)           */
/* ===================================================  UDB_DSI.DOP_CFG1  ==================================================== */
#define UDB_DSI_DOP_CFG1_DOP4SEL_Pos      (0UL)                 /*!< UDB_DSI DOP_CFG1: DOP4SEL (Bit 0)                         */
#define UDB_DSI_DOP_CFG1_DOP4SEL_Msk      (0x1fUL)              /*!< UDB_DSI DOP_CFG1: DOP4SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOP_CFG1_DOP5SEL_Pos      (8UL)                 /*!< UDB_DSI DOP_CFG1: DOP5SEL (Bit 8)                         */
#define UDB_DSI_DOP_CFG1_DOP5SEL_Msk      (0x1f00UL)            /*!< UDB_DSI DOP_CFG1: DOP5SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOP_CFG1_DOP6SEL_Pos      (16UL)                /*!< UDB_DSI DOP_CFG1: DOP6SEL (Bit 16)                        */
#define UDB_DSI_DOP_CFG1_DOP6SEL_Msk      (0x1f0000UL)          /*!< UDB_DSI DOP_CFG1: DOP6SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOP_CFG1_DOP7SEL_Pos      (24UL)                /*!< UDB_DSI DOP_CFG1: DOP7SEL (Bit 24)                        */
#define UDB_DSI_DOP_CFG1_DOP7SEL_Msk      (0x1f000000UL)        /*!< UDB_DSI DOP_CFG1: DOP7SEL (Bitfield-Mask: 0x1f)           */
/* ===================================================  UDB_DSI.DOP_CFG2  ==================================================== */
#define UDB_DSI_DOP_CFG2_DOP8SEL_Pos      (0UL)                 /*!< UDB_DSI DOP_CFG2: DOP8SEL (Bit 0)                         */
#define UDB_DSI_DOP_CFG2_DOP8SEL_Msk      (0x1fUL)              /*!< UDB_DSI DOP_CFG2: DOP8SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOP_CFG2_DOP9SEL_Pos      (8UL)                 /*!< UDB_DSI DOP_CFG2: DOP9SEL (Bit 8)                         */
#define UDB_DSI_DOP_CFG2_DOP9SEL_Msk      (0x1f00UL)            /*!< UDB_DSI DOP_CFG2: DOP9SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOP_CFG2_DOP10SEL_Pos     (16UL)                /*!< UDB_DSI DOP_CFG2: DOP10SEL (Bit 16)                       */
#define UDB_DSI_DOP_CFG2_DOP10SEL_Msk     (0x1f0000UL)          /*!< UDB_DSI DOP_CFG2: DOP10SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_DOP_CFG2_DOP11SEL_Pos     (24UL)                /*!< UDB_DSI DOP_CFG2: DOP11SEL (Bit 24)                       */
#define UDB_DSI_DOP_CFG2_DOP11SEL_Msk     (0x1f000000UL)        /*!< UDB_DSI DOP_CFG2: DOP11SEL (Bitfield-Mask: 0x1f)          */
/* ===================================================  UDB_DSI.DOP_CFG3  ==================================================== */
#define UDB_DSI_DOP_CFG3_DOP12SEL_Pos     (0UL)                 /*!< UDB_DSI DOP_CFG3: DOP12SEL (Bit 0)                        */
#define UDB_DSI_DOP_CFG3_DOP12SEL_Msk     (0x1fUL)              /*!< UDB_DSI DOP_CFG3: DOP12SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_DOP_CFG3_DOP13SEL_Pos     (8UL)                 /*!< UDB_DSI DOP_CFG3: DOP13SEL (Bit 8)                        */
#define UDB_DSI_DOP_CFG3_DOP13SEL_Msk     (0x1f00UL)            /*!< UDB_DSI DOP_CFG3: DOP13SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_DOP_CFG3_DOP14SEL_Pos     (16UL)                /*!< UDB_DSI DOP_CFG3: DOP14SEL (Bit 16)                       */
#define UDB_DSI_DOP_CFG3_DOP14SEL_Msk     (0x1f0000UL)          /*!< UDB_DSI DOP_CFG3: DOP14SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_DOP_CFG3_DOP15SEL_Pos     (24UL)                /*!< UDB_DSI DOP_CFG3: DOP15SEL (Bit 24)                       */
#define UDB_DSI_DOP_CFG3_DOP15SEL_Msk     (0x1f000000UL)        /*!< UDB_DSI DOP_CFG3: DOP15SEL (Bitfield-Mask: 0x1f)          */
/* ===================================================  UDB_DSI.DOT_CFG0  ==================================================== */
#define UDB_DSI_DOT_CFG0_DOT0SEL_Pos      (0UL)                 /*!< UDB_DSI DOT_CFG0: DOT0SEL (Bit 0)                         */
#define UDB_DSI_DOT_CFG0_DOT0SEL_Msk      (0x1fUL)              /*!< UDB_DSI DOT_CFG0: DOT0SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOT_CFG0_DOT1SEL_Pos      (8UL)                 /*!< UDB_DSI DOT_CFG0: DOT1SEL (Bit 8)                         */
#define UDB_DSI_DOT_CFG0_DOT1SEL_Msk      (0x1f00UL)            /*!< UDB_DSI DOT_CFG0: DOT1SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOT_CFG0_DOT2SEL_Pos      (16UL)                /*!< UDB_DSI DOT_CFG0: DOT2SEL (Bit 16)                        */
#define UDB_DSI_DOT_CFG0_DOT2SEL_Msk      (0x1f0000UL)          /*!< UDB_DSI DOT_CFG0: DOT2SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOT_CFG0_DOT3SEL_Pos      (24UL)                /*!< UDB_DSI DOT_CFG0: DOT3SEL (Bit 24)                        */
#define UDB_DSI_DOT_CFG0_DOT3SEL_Msk      (0x1f000000UL)        /*!< UDB_DSI DOT_CFG0: DOT3SEL (Bitfield-Mask: 0x1f)           */
/* ===================================================  UDB_DSI.DOT_CFG1  ==================================================== */
#define UDB_DSI_DOT_CFG1_DOT4SEL_Pos      (0UL)                 /*!< UDB_DSI DOT_CFG1: DOT4SEL (Bit 0)                         */
#define UDB_DSI_DOT_CFG1_DOT4SEL_Msk      (0x1fUL)              /*!< UDB_DSI DOT_CFG1: DOT4SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOT_CFG1_DOT5SEL_Pos      (8UL)                 /*!< UDB_DSI DOT_CFG1: DOT5SEL (Bit 8)                         */
#define UDB_DSI_DOT_CFG1_DOT5SEL_Msk      (0x1f00UL)            /*!< UDB_DSI DOT_CFG1: DOT5SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOT_CFG1_DOT6SEL_Pos      (16UL)                /*!< UDB_DSI DOT_CFG1: DOT6SEL (Bit 16)                        */
#define UDB_DSI_DOT_CFG1_DOT6SEL_Msk      (0x1f0000UL)          /*!< UDB_DSI DOT_CFG1: DOT6SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOT_CFG1_DOT7SEL_Pos      (24UL)                /*!< UDB_DSI DOT_CFG1: DOT7SEL (Bit 24)                        */
#define UDB_DSI_DOT_CFG1_DOT7SEL_Msk      (0x1f000000UL)        /*!< UDB_DSI DOT_CFG1: DOT7SEL (Bitfield-Mask: 0x1f)           */
/* ===================================================  UDB_DSI.DOT_CFG2  ==================================================== */
#define UDB_DSI_DOT_CFG2_DOT8SEL_Pos      (0UL)                 /*!< UDB_DSI DOT_CFG2: DOT8SEL (Bit 0)                         */
#define UDB_DSI_DOT_CFG2_DOT8SEL_Msk      (0x1fUL)              /*!< UDB_DSI DOT_CFG2: DOT8SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOT_CFG2_DOT9SEL_Pos      (8UL)                 /*!< UDB_DSI DOT_CFG2: DOT9SEL (Bit 8)                         */
#define UDB_DSI_DOT_CFG2_DOT9SEL_Msk      (0x1f00UL)            /*!< UDB_DSI DOT_CFG2: DOT9SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_DOT_CFG2_DOT10SEL_Pos     (16UL)                /*!< UDB_DSI DOT_CFG2: DOT10SEL (Bit 16)                       */
#define UDB_DSI_DOT_CFG2_DOT10SEL_Msk     (0x1f0000UL)          /*!< UDB_DSI DOT_CFG2: DOT10SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_DOT_CFG2_DOT11SEL_Pos     (24UL)                /*!< UDB_DSI DOT_CFG2: DOT11SEL (Bit 24)                       */
#define UDB_DSI_DOT_CFG2_DOT11SEL_Msk     (0x1f000000UL)        /*!< UDB_DSI DOT_CFG2: DOT11SEL (Bitfield-Mask: 0x1f)          */
/* ===================================================  UDB_DSI.DOT_CFG3  ==================================================== */
#define UDB_DSI_DOT_CFG3_DOT12SEL_Pos     (0UL)                 /*!< UDB_DSI DOT_CFG3: DOT12SEL (Bit 0)                        */
#define UDB_DSI_DOT_CFG3_DOT12SEL_Msk     (0x1fUL)              /*!< UDB_DSI DOT_CFG3: DOT12SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_DOT_CFG3_DOT13SEL_Pos     (8UL)                 /*!< UDB_DSI DOT_CFG3: DOT13SEL (Bit 8)                        */
#define UDB_DSI_DOT_CFG3_DOT13SEL_Msk     (0x1f00UL)            /*!< UDB_DSI DOT_CFG3: DOT13SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_DOT_CFG3_DOT14SEL_Pos     (16UL)                /*!< UDB_DSI DOT_CFG3: DOT14SEL (Bit 16)                       */
#define UDB_DSI_DOT_CFG3_DOT14SEL_Msk     (0x1f0000UL)          /*!< UDB_DSI DOT_CFG3: DOT14SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_DOT_CFG3_DOT15SEL_Pos     (24UL)                /*!< UDB_DSI DOT_CFG3: DOT15SEL (Bit 24)                       */
#define UDB_DSI_DOT_CFG3_DOT15SEL_Msk     (0x1f000000UL)        /*!< UDB_DSI DOT_CFG3: DOT15SEL (Bitfield-Mask: 0x1f)          */
/* ===================================================  UDB_DSI.RVO_CFG0  ==================================================== */
#define UDB_DSI_RVO_CFG0_RVO0SEL_Pos      (0UL)                 /*!< UDB_DSI RVO_CFG0: RVO0SEL (Bit 0)                         */
#define UDB_DSI_RVO_CFG0_RVO0SEL_Msk      (0x1fUL)              /*!< UDB_DSI RVO_CFG0: RVO0SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_RVO_CFG0_RVO1SEL_Pos      (8UL)                 /*!< UDB_DSI RVO_CFG0: RVO1SEL (Bit 8)                         */
#define UDB_DSI_RVO_CFG0_RVO1SEL_Msk      (0x1f00UL)            /*!< UDB_DSI RVO_CFG0: RVO1SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_RVO_CFG0_RVO2SEL_Pos      (16UL)                /*!< UDB_DSI RVO_CFG0: RVO2SEL (Bit 16)                        */
#define UDB_DSI_RVO_CFG0_RVO2SEL_Msk      (0x1f0000UL)          /*!< UDB_DSI RVO_CFG0: RVO2SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_RVO_CFG0_RVO3SEL_Pos      (24UL)                /*!< UDB_DSI RVO_CFG0: RVO3SEL (Bit 24)                        */
#define UDB_DSI_RVO_CFG0_RVO3SEL_Msk      (0x1f000000UL)        /*!< UDB_DSI RVO_CFG0: RVO3SEL (Bitfield-Mask: 0x1f)           */
/* ===================================================  UDB_DSI.RVO_CFG1  ==================================================== */
#define UDB_DSI_RVO_CFG1_RVO4SEL_Pos      (0UL)                 /*!< UDB_DSI RVO_CFG1: RVO4SEL (Bit 0)                         */
#define UDB_DSI_RVO_CFG1_RVO4SEL_Msk      (0x1fUL)              /*!< UDB_DSI RVO_CFG1: RVO4SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_RVO_CFG1_RVO5SEL_Pos      (8UL)                 /*!< UDB_DSI RVO_CFG1: RVO5SEL (Bit 8)                         */
#define UDB_DSI_RVO_CFG1_RVO5SEL_Msk      (0x1f00UL)            /*!< UDB_DSI RVO_CFG1: RVO5SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_RVO_CFG1_RVO6SEL_Pos      (16UL)                /*!< UDB_DSI RVO_CFG1: RVO6SEL (Bit 16)                        */
#define UDB_DSI_RVO_CFG1_RVO6SEL_Msk      (0x1f0000UL)          /*!< UDB_DSI RVO_CFG1: RVO6SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_RVO_CFG1_RVO7SEL_Pos      (24UL)                /*!< UDB_DSI RVO_CFG1: RVO7SEL (Bit 24)                        */
#define UDB_DSI_RVO_CFG1_RVO7SEL_Msk      (0x1f000000UL)        /*!< UDB_DSI RVO_CFG1: RVO7SEL (Bitfield-Mask: 0x1f)           */
/* ===================================================  UDB_DSI.RVO_CFG2  ==================================================== */
#define UDB_DSI_RVO_CFG2_RVO8SEL_Pos      (0UL)                 /*!< UDB_DSI RVO_CFG2: RVO8SEL (Bit 0)                         */
#define UDB_DSI_RVO_CFG2_RVO8SEL_Msk      (0x1fUL)              /*!< UDB_DSI RVO_CFG2: RVO8SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_RVO_CFG2_RVO9SEL_Pos      (8UL)                 /*!< UDB_DSI RVO_CFG2: RVO9SEL (Bit 8)                         */
#define UDB_DSI_RVO_CFG2_RVO9SEL_Msk      (0x1f00UL)            /*!< UDB_DSI RVO_CFG2: RVO9SEL (Bitfield-Mask: 0x1f)           */
#define UDB_DSI_RVO_CFG2_RVO10SEL_Pos     (16UL)                /*!< UDB_DSI RVO_CFG2: RVO10SEL (Bit 16)                       */
#define UDB_DSI_RVO_CFG2_RVO10SEL_Msk     (0x1f0000UL)          /*!< UDB_DSI RVO_CFG2: RVO10SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_RVO_CFG2_RVO11SEL_Pos     (24UL)                /*!< UDB_DSI RVO_CFG2: RVO11SEL (Bit 24)                       */
#define UDB_DSI_RVO_CFG2_RVO11SEL_Msk     (0x1f000000UL)        /*!< UDB_DSI RVO_CFG2: RVO11SEL (Bitfield-Mask: 0x1f)          */
/* ===================================================  UDB_DSI.RVO_CFG3  ==================================================== */
#define UDB_DSI_RVO_CFG3_RVO12SEL_Pos     (0UL)                 /*!< UDB_DSI RVO_CFG3: RVO12SEL (Bit 0)                        */
#define UDB_DSI_RVO_CFG3_RVO12SEL_Msk     (0x1fUL)              /*!< UDB_DSI RVO_CFG3: RVO12SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_RVO_CFG3_RVO13SEL_Pos     (8UL)                 /*!< UDB_DSI RVO_CFG3: RVO13SEL (Bit 8)                        */
#define UDB_DSI_RVO_CFG3_RVO13SEL_Msk     (0x1f00UL)            /*!< UDB_DSI RVO_CFG3: RVO13SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_RVO_CFG3_RVO14SEL_Pos     (16UL)                /*!< UDB_DSI RVO_CFG3: RVO14SEL (Bit 16)                       */
#define UDB_DSI_RVO_CFG3_RVO14SEL_Msk     (0x1f0000UL)          /*!< UDB_DSI RVO_CFG3: RVO14SEL (Bitfield-Mask: 0x1f)          */
#define UDB_DSI_RVO_CFG3_RVO15SEL_Pos     (24UL)                /*!< UDB_DSI RVO_CFG3: RVO15SEL (Bit 24)                       */
#define UDB_DSI_RVO_CFG3_RVO15SEL_Msk     (0x1f000000UL)        /*!< UDB_DSI RVO_CFG3: RVO15SEL (Bitfield-Mask: 0x1f)          */
/* ===================================================  UDB_DSI.LVO_CFG0  ==================================================== */
#define UDB_DSI_LVO_CFG0_LVO0SEL_Pos      (0UL)                 /*!< UDB_DSI LVO_CFG0: LVO0SEL (Bit 0)                         */
#define UDB_DSI_LVO_CFG0_LVO0SEL_Msk      (0xfUL)               /*!< UDB_DSI LVO_CFG0: LVO0SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LVO_CFG0_LVO1SEL_Pos      (4UL)                 /*!< UDB_DSI LVO_CFG0: LVO1SEL (Bit 4)                         */
#define UDB_DSI_LVO_CFG0_LVO1SEL_Msk      (0xf0UL)              /*!< UDB_DSI LVO_CFG0: LVO1SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LVO_CFG0_LVO2SEL_Pos      (8UL)                 /*!< UDB_DSI LVO_CFG0: LVO2SEL (Bit 8)                         */
#define UDB_DSI_LVO_CFG0_LVO2SEL_Msk      (0xf00UL)             /*!< UDB_DSI LVO_CFG0: LVO2SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LVO_CFG0_LVO3SEL_Pos      (12UL)                /*!< UDB_DSI LVO_CFG0: LVO3SEL (Bit 12)                        */
#define UDB_DSI_LVO_CFG0_LVO3SEL_Msk      (0xf000UL)            /*!< UDB_DSI LVO_CFG0: LVO3SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LVO_CFG0_LVO4SEL_Pos      (16UL)                /*!< UDB_DSI LVO_CFG0: LVO4SEL (Bit 16)                        */
#define UDB_DSI_LVO_CFG0_LVO4SEL_Msk      (0xf0000UL)           /*!< UDB_DSI LVO_CFG0: LVO4SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LVO_CFG0_LVO5SEL_Pos      (20UL)                /*!< UDB_DSI LVO_CFG0: LVO5SEL (Bit 20)                        */
#define UDB_DSI_LVO_CFG0_LVO5SEL_Msk      (0xf00000UL)          /*!< UDB_DSI LVO_CFG0: LVO5SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LVO_CFG0_LVO6SEL_Pos      (24UL)                /*!< UDB_DSI LVO_CFG0: LVO6SEL (Bit 24)                        */
#define UDB_DSI_LVO_CFG0_LVO6SEL_Msk      (0xf000000UL)         /*!< UDB_DSI LVO_CFG0: LVO6SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LVO_CFG0_LVO7SEL_Pos      (28UL)                /*!< UDB_DSI LVO_CFG0: LVO7SEL (Bit 28)                        */
#define UDB_DSI_LVO_CFG0_LVO7SEL_Msk      (0xf0000000UL)        /*!< UDB_DSI LVO_CFG0: LVO7SEL (Bitfield-Mask: 0x0f)           */
/* ===================================================  UDB_DSI.LVO_CFG1  ==================================================== */
#define UDB_DSI_LVO_CFG1_LVO8SEL_Pos      (0UL)                 /*!< UDB_DSI LVO_CFG1: LVO8SEL (Bit 0)                         */
#define UDB_DSI_LVO_CFG1_LVO8SEL_Msk      (0xfUL)               /*!< UDB_DSI LVO_CFG1: LVO8SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LVO_CFG1_LVO9SEL_Pos      (4UL)                 /*!< UDB_DSI LVO_CFG1: LVO9SEL (Bit 4)                         */
#define UDB_DSI_LVO_CFG1_LVO9SEL_Msk      (0xf0UL)              /*!< UDB_DSI LVO_CFG1: LVO9SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LVO_CFG1_LVO10SEL_Pos     (8UL)                 /*!< UDB_DSI LVO_CFG1: LVO10SEL (Bit 8)                        */
#define UDB_DSI_LVO_CFG1_LVO10SEL_Msk     (0xf00UL)             /*!< UDB_DSI LVO_CFG1: LVO10SEL (Bitfield-Mask: 0x0f)          */
#define UDB_DSI_LVO_CFG1_LVO11SEL_Pos     (12UL)                /*!< UDB_DSI LVO_CFG1: LVO11SEL (Bit 12)                       */
#define UDB_DSI_LVO_CFG1_LVO11SEL_Msk     (0xf000UL)            /*!< UDB_DSI LVO_CFG1: LVO11SEL (Bitfield-Mask: 0x0f)          */
#define UDB_DSI_LVO_CFG1_LVO12SEL_Pos     (16UL)                /*!< UDB_DSI LVO_CFG1: LVO12SEL (Bit 16)                       */
#define UDB_DSI_LVO_CFG1_LVO12SEL_Msk     (0xf0000UL)           /*!< UDB_DSI LVO_CFG1: LVO12SEL (Bitfield-Mask: 0x0f)          */
#define UDB_DSI_LVO_CFG1_LVO13SEL_Pos     (20UL)                /*!< UDB_DSI LVO_CFG1: LVO13SEL (Bit 20)                       */
#define UDB_DSI_LVO_CFG1_LVO13SEL_Msk     (0xf00000UL)          /*!< UDB_DSI LVO_CFG1: LVO13SEL (Bitfield-Mask: 0x0f)          */
#define UDB_DSI_LVO_CFG1_LVO14SEL_Pos     (24UL)                /*!< UDB_DSI LVO_CFG1: LVO14SEL (Bit 24)                       */
#define UDB_DSI_LVO_CFG1_LVO14SEL_Msk     (0xf000000UL)         /*!< UDB_DSI LVO_CFG1: LVO14SEL (Bitfield-Mask: 0x0f)          */
#define UDB_DSI_LVO_CFG1_LVO15SEL_Pos     (28UL)                /*!< UDB_DSI LVO_CFG1: LVO15SEL (Bit 28)                       */
#define UDB_DSI_LVO_CFG1_LVO15SEL_Msk     (0xf0000000UL)        /*!< UDB_DSI LVO_CFG1: LVO15SEL (Bitfield-Mask: 0x0f)          */
/* ===================================================  UDB_DSI.RHO_CFG0  ==================================================== */
#define UDB_DSI_RHO_CFG0_RHOSEL_Pos       (0UL)                 /*!< UDB_DSI RHO_CFG0: RHOSEL (Bit 0)                          */
#define UDB_DSI_RHO_CFG0_RHOSEL_Msk       (0xffffffffUL)        /*!< UDB_DSI RHO_CFG0: RHOSEL (Bitfield-Mask: 0xffffffff)      */
/* ===================================================  UDB_DSI.RHO_CFG1  ==================================================== */
#define UDB_DSI_RHO_CFG1_RHOSEL_Pos       (0UL)                 /*!< UDB_DSI RHO_CFG1: RHOSEL (Bit 0)                          */
#define UDB_DSI_RHO_CFG1_RHOSEL_Msk       (0xffffffffUL)        /*!< UDB_DSI RHO_CFG1: RHOSEL (Bitfield-Mask: 0xffffffff)      */
/* ===================================================  UDB_DSI.RHO_CFG2  ==================================================== */
#define UDB_DSI_RHO_CFG2_RHOSEL_Pos       (0UL)                 /*!< UDB_DSI RHO_CFG2: RHOSEL (Bit 0)                          */
#define UDB_DSI_RHO_CFG2_RHOSEL_Msk       (0xffffffffUL)        /*!< UDB_DSI RHO_CFG2: RHOSEL (Bitfield-Mask: 0xffffffff)      */
/* ===================================================  UDB_DSI.LHO_CFG0  ==================================================== */
#define UDB_DSI_LHO_CFG0_LHO0SEL_Pos      (0UL)                 /*!< UDB_DSI LHO_CFG0: LHO0SEL (Bit 0)                         */
#define UDB_DSI_LHO_CFG0_LHO0SEL_Msk      (0xfUL)               /*!< UDB_DSI LHO_CFG0: LHO0SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LHO_CFG0_LHO1SEL_Pos      (4UL)                 /*!< UDB_DSI LHO_CFG0: LHO1SEL (Bit 4)                         */
#define UDB_DSI_LHO_CFG0_LHO1SEL_Msk      (0xf0UL)              /*!< UDB_DSI LHO_CFG0: LHO1SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LHO_CFG0_LHO2SEL_Pos      (8UL)                 /*!< UDB_DSI LHO_CFG0: LHO2SEL (Bit 8)                         */
#define UDB_DSI_LHO_CFG0_LHO2SEL_Msk      (0xf00UL)             /*!< UDB_DSI LHO_CFG0: LHO2SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LHO_CFG0_LHO3SEL_Pos      (12UL)                /*!< UDB_DSI LHO_CFG0: LHO3SEL (Bit 12)                        */
#define UDB_DSI_LHO_CFG0_LHO3SEL_Msk      (0xf000UL)            /*!< UDB_DSI LHO_CFG0: LHO3SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LHO_CFG0_LHO4SEL_Pos      (16UL)                /*!< UDB_DSI LHO_CFG0: LHO4SEL (Bit 16)                        */
#define UDB_DSI_LHO_CFG0_LHO4SEL_Msk      (0xf0000UL)           /*!< UDB_DSI LHO_CFG0: LHO4SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LHO_CFG0_LHO5SEL_Pos      (20UL)                /*!< UDB_DSI LHO_CFG0: LHO5SEL (Bit 20)                        */
#define UDB_DSI_LHO_CFG0_LHO5SEL_Msk      (0xf00000UL)          /*!< UDB_DSI LHO_CFG0: LHO5SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LHO_CFG0_LHO6SEL_Pos      (24UL)                /*!< UDB_DSI LHO_CFG0: LHO6SEL (Bit 24)                        */
#define UDB_DSI_LHO_CFG0_LHO6SEL_Msk      (0xf000000UL)         /*!< UDB_DSI LHO_CFG0: LHO6SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LHO_CFG0_LHO7SEL_Pos      (28UL)                /*!< UDB_DSI LHO_CFG0: LHO7SEL (Bit 28)                        */
#define UDB_DSI_LHO_CFG0_LHO7SEL_Msk      (0xf0000000UL)        /*!< UDB_DSI LHO_CFG0: LHO7SEL (Bitfield-Mask: 0x0f)           */
/* ===================================================  UDB_DSI.LHO_CFG1  ==================================================== */
#define UDB_DSI_LHO_CFG1_LHO8SEL_Pos      (0UL)                 /*!< UDB_DSI LHO_CFG1: LHO8SEL (Bit 0)                         */
#define UDB_DSI_LHO_CFG1_LHO8SEL_Msk      (0xfUL)               /*!< UDB_DSI LHO_CFG1: LHO8SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LHO_CFG1_LHO9SEL_Pos      (4UL)                 /*!< UDB_DSI LHO_CFG1: LHO9SEL (Bit 4)                         */
#define UDB_DSI_LHO_CFG1_LHO9SEL_Msk      (0xf0UL)              /*!< UDB_DSI LHO_CFG1: LHO9SEL (Bitfield-Mask: 0x0f)           */
#define UDB_DSI_LHO_CFG1_LHO10SEL_Pos     (8UL)                 /*!< UDB_DSI LHO_CFG1: LHO10SEL (Bit 8)                        */
#define UDB_DSI_LHO_CFG1_LHO10SEL_Msk     (0xf00UL)             /*!< UDB_DSI LHO_CFG1: LHO10SEL (Bitfield-Mask: 0x0f)          */
#define UDB_DSI_LHO_CFG1_LHO11SEL_Pos     (12UL)                /*!< UDB_DSI LHO_CFG1: LHO11SEL (Bit 12)                       */
#define UDB_DSI_LHO_CFG1_LHO11SEL_Msk     (0xf000UL)            /*!< UDB_DSI LHO_CFG1: LHO11SEL (Bitfield-Mask: 0x0f)          */
#define UDB_DSI_LHO_CFG1_LHO12SEL_Pos     (16UL)                /*!< UDB_DSI LHO_CFG1: LHO12SEL (Bit 16)                       */
