ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_udb.h
/* ======================================================  UDB_PA.CFG0  ====================================================== */
#define UDB_PA_CFG0_CLKIN_EN_SEL_Pos      (0UL)                 /*!< UDB_PA CFG0: CLKIN_EN_SEL (Bit 0)                         */
#define UDB_PA_CFG0_CLKIN_EN_SEL_Msk      (0x3UL)               /*!< UDB_PA CFG0: CLKIN_EN_SEL (Bitfield-Mask: 0x03)           */
#define UDB_PA_CFG0_CLKIN_EN_MODE_Pos     (2UL)                 /*!< UDB_PA CFG0: CLKIN_EN_MODE (Bit 2)                        */
#define UDB_PA_CFG0_CLKIN_EN_MODE_Msk     (0xcUL)               /*!< UDB_PA CFG0: CLKIN_EN_MODE (Bitfield-Mask: 0x03)          */
#define UDB_PA_CFG0_CLKIN_EN_INV_Pos      (4UL)                 /*!< UDB_PA CFG0: CLKIN_EN_INV (Bit 4)                         */
#define UDB_PA_CFG0_CLKIN_EN_INV_Msk      (0x10UL)              /*!< UDB_PA CFG0: CLKIN_EN_INV (Bitfield-Mask: 0x01)           */
#define UDB_PA_CFG0_CLKIN_INV_Pos         (5UL)                 /*!< UDB_PA CFG0: CLKIN_INV (Bit 5)                            */
#define UDB_PA_CFG0_CLKIN_INV_Msk         (0x20UL)              /*!< UDB_PA CFG0: CLKIN_INV (Bitfield-Mask: 0x01)              */
/* ======================================================  UDB_PA.CFG1  ====================================================== */
#define UDB_PA_CFG1_CLKOUT_EN_SEL_Pos     (0UL)                 /*!< UDB_PA CFG1: CLKOUT_EN_SEL (Bit 0)                        */
#define UDB_PA_CFG1_CLKOUT_EN_SEL_Msk     (0x3UL)               /*!< UDB_PA CFG1: CLKOUT_EN_SEL (Bitfield-Mask: 0x03)          */
#define UDB_PA_CFG1_CLKOUT_EN_MODE_Pos    (2UL)                 /*!< UDB_PA CFG1: CLKOUT_EN_MODE (Bit 2)                       */
#define UDB_PA_CFG1_CLKOUT_EN_MODE_Msk    (0xcUL)               /*!< UDB_PA CFG1: CLKOUT_EN_MODE (Bitfield-Mask: 0x03)         */
#define UDB_PA_CFG1_CLKOUT_EN_INV_Pos     (4UL)                 /*!< UDB_PA CFG1: CLKOUT_EN_INV (Bit 4)                        */
#define UDB_PA_CFG1_CLKOUT_EN_INV_Msk     (0x10UL)              /*!< UDB_PA CFG1: CLKOUT_EN_INV (Bitfield-Mask: 0x01)          */
#define UDB_PA_CFG1_CLKOUT_INV_Pos        (5UL)                 /*!< UDB_PA CFG1: CLKOUT_INV (Bit 5)                           */
#define UDB_PA_CFG1_CLKOUT_INV_Msk        (0x20UL)              /*!< UDB_PA CFG1: CLKOUT_INV (Bitfield-Mask: 0x01)             */
/* ======================================================  UDB_PA.CFG2  ====================================================== */
#define UDB_PA_CFG2_CLKIN_SEL_Pos         (0UL)                 /*!< UDB_PA CFG2: CLKIN_SEL (Bit 0)                            */
#define UDB_PA_CFG2_CLKIN_SEL_Msk         (0xfUL)               /*!< UDB_PA CFG2: CLKIN_SEL (Bitfield-Mask: 0x0f)              */
#define UDB_PA_CFG2_CLKOUT_SEL_Pos        (4UL)                 /*!< UDB_PA CFG2: CLKOUT_SEL (Bit 4)                           */
#define UDB_PA_CFG2_CLKOUT_SEL_Msk        (0xf0UL)              /*!< UDB_PA CFG2: CLKOUT_SEL (Bitfield-Mask: 0x0f)             */
/* ======================================================  UDB_PA.CFG3  ====================================================== */
#define UDB_PA_CFG3_RES_IN_SEL_Pos        (0UL)                 /*!< UDB_PA CFG3: RES_IN_SEL (Bit 0)                           */
#define UDB_PA_CFG3_RES_IN_SEL_Msk        (0x3UL)               /*!< UDB_PA CFG3: RES_IN_SEL (Bitfield-Mask: 0x03)             */
#define UDB_PA_CFG3_RES_IN_INV_Pos        (2UL)                 /*!< UDB_PA CFG3: RES_IN_INV (Bit 2)                           */
#define UDB_PA_CFG3_RES_IN_INV_Msk        (0x4UL)               /*!< UDB_PA CFG3: RES_IN_INV (Bitfield-Mask: 0x01)             */
#define UDB_PA_CFG3_RES_OUT_SEL_Pos       (4UL)                 /*!< UDB_PA CFG3: RES_OUT_SEL (Bit 4)                          */
#define UDB_PA_CFG3_RES_OUT_SEL_Msk       (0x30UL)              /*!< UDB_PA CFG3: RES_OUT_SEL (Bitfield-Mask: 0x03)            */
#define UDB_PA_CFG3_RES_OUT_INV_Pos       (6UL)                 /*!< UDB_PA CFG3: RES_OUT_INV (Bit 6)                          */
#define UDB_PA_CFG3_RES_OUT_INV_Msk       (0x40UL)              /*!< UDB_PA CFG3: RES_OUT_INV (Bitfield-Mask: 0x01)            */
/* ======================================================  UDB_PA.CFG4  ====================================================== */
#define UDB_PA_CFG4_RES_IN_EN_Pos         (0UL)                 /*!< UDB_PA CFG4: RES_IN_EN (Bit 0)                            */
#define UDB_PA_CFG4_RES_IN_EN_Msk         (0x1UL)               /*!< UDB_PA CFG4: RES_IN_EN (Bitfield-Mask: 0x01)              */
#define UDB_PA_CFG4_RES_OUT_EN_Pos        (1UL)                 /*!< UDB_PA CFG4: RES_OUT_EN (Bit 1)                           */
#define UDB_PA_CFG4_RES_OUT_EN_Msk        (0x2UL)               /*!< UDB_PA CFG4: RES_OUT_EN (Bitfield-Mask: 0x01)             */
#define UDB_PA_CFG4_RES_OE_EN_Pos         (2UL)                 /*!< UDB_PA CFG4: RES_OE_EN (Bit 2)                            */
#define UDB_PA_CFG4_RES_OE_EN_Msk         (0x4UL)               /*!< UDB_PA CFG4: RES_OE_EN (Bitfield-Mask: 0x01)              */
/* ======================================================  UDB_PA.CFG5  ====================================================== */
#define UDB_PA_CFG5_PIN_SEL_Pos           (0UL)                 /*!< UDB_PA CFG5: PIN_SEL (Bit 0)                              */
#define UDB_PA_CFG5_PIN_SEL_Msk           (0x7UL)               /*!< UDB_PA CFG5: PIN_SEL (Bitfield-Mask: 0x07)                */
/* ======================================================  UDB_PA.CFG6  ====================================================== */
#define UDB_PA_CFG6_IN_SYNC0_Pos          (0UL)                 /*!< UDB_PA CFG6: IN_SYNC0 (Bit 0)                             */
#define UDB_PA_CFG6_IN_SYNC0_Msk          (0x3UL)               /*!< UDB_PA CFG6: IN_SYNC0 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG6_IN_SYNC1_Pos          (2UL)                 /*!< UDB_PA CFG6: IN_SYNC1 (Bit 2)                             */
#define UDB_PA_CFG6_IN_SYNC1_Msk          (0xcUL)               /*!< UDB_PA CFG6: IN_SYNC1 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG6_IN_SYNC2_Pos          (4UL)                 /*!< UDB_PA CFG6: IN_SYNC2 (Bit 4)                             */
#define UDB_PA_CFG6_IN_SYNC2_Msk          (0x30UL)              /*!< UDB_PA CFG6: IN_SYNC2 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG6_IN_SYNC3_Pos          (6UL)                 /*!< UDB_PA CFG6: IN_SYNC3 (Bit 6)                             */
#define UDB_PA_CFG6_IN_SYNC3_Msk          (0xc0UL)              /*!< UDB_PA CFG6: IN_SYNC3 (Bitfield-Mask: 0x03)               */
/* ======================================================  UDB_PA.CFG7  ====================================================== */
#define UDB_PA_CFG7_IN_SYNC4_Pos          (0UL)                 /*!< UDB_PA CFG7: IN_SYNC4 (Bit 0)                             */
#define UDB_PA_CFG7_IN_SYNC4_Msk          (0x3UL)               /*!< UDB_PA CFG7: IN_SYNC4 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG7_IN_SYNC5_Pos          (2UL)                 /*!< UDB_PA CFG7: IN_SYNC5 (Bit 2)                             */
#define UDB_PA_CFG7_IN_SYNC5_Msk          (0xcUL)               /*!< UDB_PA CFG7: IN_SYNC5 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG7_IN_SYNC6_Pos          (4UL)                 /*!< UDB_PA CFG7: IN_SYNC6 (Bit 4)                             */
#define UDB_PA_CFG7_IN_SYNC6_Msk          (0x30UL)              /*!< UDB_PA CFG7: IN_SYNC6 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG7_IN_SYNC7_Pos          (6UL)                 /*!< UDB_PA CFG7: IN_SYNC7 (Bit 6)                             */
#define UDB_PA_CFG7_IN_SYNC7_Msk          (0xc0UL)              /*!< UDB_PA CFG7: IN_SYNC7 (Bitfield-Mask: 0x03)               */
/* ======================================================  UDB_PA.CFG8  ====================================================== */
#define UDB_PA_CFG8_OUT_SYNC0_Pos         (0UL)                 /*!< UDB_PA CFG8: OUT_SYNC0 (Bit 0)                            */
#define UDB_PA_CFG8_OUT_SYNC0_Msk         (0x3UL)               /*!< UDB_PA CFG8: OUT_SYNC0 (Bitfield-Mask: 0x03)              */
#define UDB_PA_CFG8_OUT_SYNC1_Pos         (2UL)                 /*!< UDB_PA CFG8: OUT_SYNC1 (Bit 2)                            */
#define UDB_PA_CFG8_OUT_SYNC1_Msk         (0xcUL)               /*!< UDB_PA CFG8: OUT_SYNC1 (Bitfield-Mask: 0x03)              */
#define UDB_PA_CFG8_OUT_SYNC2_Pos         (4UL)                 /*!< UDB_PA CFG8: OUT_SYNC2 (Bit 4)                            */
#define UDB_PA_CFG8_OUT_SYNC2_Msk         (0x30UL)              /*!< UDB_PA CFG8: OUT_SYNC2 (Bitfield-Mask: 0x03)              */
#define UDB_PA_CFG8_OUT_SYNC3_Pos         (6UL)                 /*!< UDB_PA CFG8: OUT_SYNC3 (Bit 6)                            */
#define UDB_PA_CFG8_OUT_SYNC3_Msk         (0xc0UL)              /*!< UDB_PA CFG8: OUT_SYNC3 (Bitfield-Mask: 0x03)              */
/* ======================================================  UDB_PA.CFG9  ====================================================== */
#define UDB_PA_CFG9_OUT_SYNC4_Pos         (0UL)                 /*!< UDB_PA CFG9: OUT_SYNC4 (Bit 0)                            */
#define UDB_PA_CFG9_OUT_SYNC4_Msk         (0x3UL)               /*!< UDB_PA CFG9: OUT_SYNC4 (Bitfield-Mask: 0x03)              */
#define UDB_PA_CFG9_OUT_SYNC5_Pos         (2UL)                 /*!< UDB_PA CFG9: OUT_SYNC5 (Bit 2)                            */
#define UDB_PA_CFG9_OUT_SYNC5_Msk         (0xcUL)               /*!< UDB_PA CFG9: OUT_SYNC5 (Bitfield-Mask: 0x03)              */
#define UDB_PA_CFG9_OUT_SYNC6_Pos         (4UL)                 /*!< UDB_PA CFG9: OUT_SYNC6 (Bit 4)                            */
#define UDB_PA_CFG9_OUT_SYNC6_Msk         (0x30UL)              /*!< UDB_PA CFG9: OUT_SYNC6 (Bitfield-Mask: 0x03)              */
#define UDB_PA_CFG9_OUT_SYNC7_Pos         (6UL)                 /*!< UDB_PA CFG9: OUT_SYNC7 (Bit 6)                            */
#define UDB_PA_CFG9_OUT_SYNC7_Msk         (0xc0UL)              /*!< UDB_PA CFG9: OUT_SYNC7 (Bitfield-Mask: 0x03)              */
/* =====================================================  UDB_PA.CFG10  ====================================================== */
#define UDB_PA_CFG10_DATA_SEL0_Pos        (0UL)                 /*!< UDB_PA CFG10: DATA_SEL0 (Bit 0)                           */
#define UDB_PA_CFG10_DATA_SEL0_Msk        (0x3UL)               /*!< UDB_PA CFG10: DATA_SEL0 (Bitfield-Mask: 0x03)             */
#define UDB_PA_CFG10_DATA_SEL1_Pos        (2UL)                 /*!< UDB_PA CFG10: DATA_SEL1 (Bit 2)                           */
#define UDB_PA_CFG10_DATA_SEL1_Msk        (0xcUL)               /*!< UDB_PA CFG10: DATA_SEL1 (Bitfield-Mask: 0x03)             */
#define UDB_PA_CFG10_DATA_SEL2_Pos        (4UL)                 /*!< UDB_PA CFG10: DATA_SEL2 (Bit 4)                           */
#define UDB_PA_CFG10_DATA_SEL2_Msk        (0x30UL)              /*!< UDB_PA CFG10: DATA_SEL2 (Bitfield-Mask: 0x03)             */
#define UDB_PA_CFG10_DATA_SEL3_Pos        (6UL)                 /*!< UDB_PA CFG10: DATA_SEL3 (Bit 6)                           */
#define UDB_PA_CFG10_DATA_SEL3_Msk        (0xc0UL)              /*!< UDB_PA CFG10: DATA_SEL3 (Bitfield-Mask: 0x03)             */
/* =====================================================  UDB_PA.CFG11  ====================================================== */
#define UDB_PA_CFG11_DATA_SEL4_Pos        (0UL)                 /*!< UDB_PA CFG11: DATA_SEL4 (Bit 0)                           */
#define UDB_PA_CFG11_DATA_SEL4_Msk        (0x3UL)               /*!< UDB_PA CFG11: DATA_SEL4 (Bitfield-Mask: 0x03)             */
#define UDB_PA_CFG11_DATA_SEL5_Pos        (2UL)                 /*!< UDB_PA CFG11: DATA_SEL5 (Bit 2)                           */
#define UDB_PA_CFG11_DATA_SEL5_Msk        (0xcUL)               /*!< UDB_PA CFG11: DATA_SEL5 (Bitfield-Mask: 0x03)             */
#define UDB_PA_CFG11_DATA_SEL6_Pos        (4UL)                 /*!< UDB_PA CFG11: DATA_SEL6 (Bit 4)                           */
#define UDB_PA_CFG11_DATA_SEL6_Msk        (0x30UL)              /*!< UDB_PA CFG11: DATA_SEL6 (Bitfield-Mask: 0x03)             */
#define UDB_PA_CFG11_DATA_SEL7_Pos        (6UL)                 /*!< UDB_PA CFG11: DATA_SEL7 (Bit 6)                           */
#define UDB_PA_CFG11_DATA_SEL7_Msk        (0xc0UL)              /*!< UDB_PA CFG11: DATA_SEL7 (Bitfield-Mask: 0x03)             */
/* =====================================================  UDB_PA.CFG12  ====================================================== */
#define UDB_PA_CFG12_OE_SEL0_Pos          (0UL)                 /*!< UDB_PA CFG12: OE_SEL0 (Bit 0)                             */
#define UDB_PA_CFG12_OE_SEL0_Msk          (0x3UL)               /*!< UDB_PA CFG12: OE_SEL0 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG12_OE_SEL1_Pos          (2UL)                 /*!< UDB_PA CFG12: OE_SEL1 (Bit 2)                             */
#define UDB_PA_CFG12_OE_SEL1_Msk          (0xcUL)               /*!< UDB_PA CFG12: OE_SEL1 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG12_OE_SEL2_Pos          (4UL)                 /*!< UDB_PA CFG12: OE_SEL2 (Bit 4)                             */
#define UDB_PA_CFG12_OE_SEL2_Msk          (0x30UL)              /*!< UDB_PA CFG12: OE_SEL2 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG12_OE_SEL3_Pos          (6UL)                 /*!< UDB_PA CFG12: OE_SEL3 (Bit 6)                             */
#define UDB_PA_CFG12_OE_SEL3_Msk          (0xc0UL)              /*!< UDB_PA CFG12: OE_SEL3 (Bitfield-Mask: 0x03)               */
/* =====================================================  UDB_PA.CFG13  ====================================================== */
#define UDB_PA_CFG13_OE_SEL4_Pos          (0UL)                 /*!< UDB_PA CFG13: OE_SEL4 (Bit 0)                             */
#define UDB_PA_CFG13_OE_SEL4_Msk          (0x3UL)               /*!< UDB_PA CFG13: OE_SEL4 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG13_OE_SEL5_Pos          (2UL)                 /*!< UDB_PA CFG13: OE_SEL5 (Bit 2)                             */
#define UDB_PA_CFG13_OE_SEL5_Msk          (0xcUL)               /*!< UDB_PA CFG13: OE_SEL5 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG13_OE_SEL6_Pos          (4UL)                 /*!< UDB_PA CFG13: OE_SEL6 (Bit 4)                             */
#define UDB_PA_CFG13_OE_SEL6_Msk          (0x30UL)              /*!< UDB_PA CFG13: OE_SEL6 (Bitfield-Mask: 0x03)               */
#define UDB_PA_CFG13_OE_SEL7_Pos          (6UL)                 /*!< UDB_PA CFG13: OE_SEL7 (Bit 6)                             */
#define UDB_PA_CFG13_OE_SEL7_Msk          (0xc0UL)              /*!< UDB_PA CFG13: OE_SEL7 (Bitfield-Mask: 0x03)               */
/* =====================================================  UDB_PA.CFG14  ====================================================== */
#define UDB_PA_CFG14_OE_SYNC0_Pos         (0UL)                 /*!< UDB_PA CFG14: OE_SYNC0 (Bit 0)                            */
#define UDB_PA_CFG14_OE_SYNC0_Msk         (0x3UL)               /*!< UDB_PA CFG14: OE_SYNC0 (Bitfield-Mask: 0x03)              */
#define UDB_PA_CFG14_OE_SYNC1_Pos         (2UL)                 /*!< UDB_PA CFG14: OE_SYNC1 (Bit 2)                            */
#define UDB_PA_CFG14_OE_SYNC1_Msk         (0xcUL)               /*!< UDB_PA CFG14: OE_SYNC1 (Bitfield-Mask: 0x03)              */
#define UDB_PA_CFG14_OE_SYNC2_Pos         (4UL)                 /*!< UDB_PA CFG14: OE_SYNC2 (Bit 4)                            */
#define UDB_PA_CFG14_OE_SYNC2_Msk         (0x30UL)              /*!< UDB_PA CFG14: OE_SYNC2 (Bitfield-Mask: 0x03)              */
#define UDB_PA_CFG14_OE_SYNC3_Pos         (6UL)                 /*!< UDB_PA CFG14: OE_SYNC3 (Bit 6)                            */
#define UDB_PA_CFG14_OE_SYNC3_Msk         (0xc0UL)              /*!< UDB_PA CFG14: OE_SYNC3 (Bitfield-Mask: 0x03)              */


/* ===================================================  UDB_BCTL.MDCLK_EN  =================================================== */
#define UDB_BCTL_MDCLK_EN_DCEN_Pos        (0UL)                 /*!< UDB_BCTL MDCLK_EN: DCEN (Bit 0)                           */
#define UDB_BCTL_MDCLK_EN_DCEN_Msk        (0xffUL)              /*!< UDB_BCTL MDCLK_EN: DCEN (Bitfield-Mask: 0xff)             */
/* ===================================================  UDB_BCTL.MBCLK_EN  =================================================== */
#define UDB_BCTL_MBCLK_EN_BCEN_Pos        (0UL)                 /*!< UDB_BCTL MBCLK_EN: BCEN (Bit 0)                           */
#define UDB_BCTL_MBCLK_EN_BCEN_Msk        (0x1UL)               /*!< UDB_BCTL MBCLK_EN: BCEN (Bitfield-Mask: 0x01)             */
/* ===================================================  UDB_BCTL.BOTSEL_L  =================================================== */
#define UDB_BCTL_BOTSEL_L_CLK_SEL0_Pos    (0UL)                 /*!< UDB_BCTL BOTSEL_L: CLK_SEL0 (Bit 0)                       */
#define UDB_BCTL_BOTSEL_L_CLK_SEL0_Msk    (0x3UL)               /*!< UDB_BCTL BOTSEL_L: CLK_SEL0 (Bitfield-Mask: 0x03)         */
#define UDB_BCTL_BOTSEL_L_CLK_SEL1_Pos    (2UL)                 /*!< UDB_BCTL BOTSEL_L: CLK_SEL1 (Bit 2)                       */
#define UDB_BCTL_BOTSEL_L_CLK_SEL1_Msk    (0xcUL)               /*!< UDB_BCTL BOTSEL_L: CLK_SEL1 (Bitfield-Mask: 0x03)         */
#define UDB_BCTL_BOTSEL_L_CLK_SEL2_Pos    (4UL)                 /*!< UDB_BCTL BOTSEL_L: CLK_SEL2 (Bit 4)                       */
#define UDB_BCTL_BOTSEL_L_CLK_SEL2_Msk    (0x30UL)              /*!< UDB_BCTL BOTSEL_L: CLK_SEL2 (Bitfield-Mask: 0x03)         */
#define UDB_BCTL_BOTSEL_L_CLK_SEL3_Pos    (6UL)                 /*!< UDB_BCTL BOTSEL_L: CLK_SEL3 (Bit 6)                       */
#define UDB_BCTL_BOTSEL_L_CLK_SEL3_Msk    (0xc0UL)              /*!< UDB_BCTL BOTSEL_L: CLK_SEL3 (Bitfield-Mask: 0x03)         */
/* ===================================================  UDB_BCTL.BOTSEL_U  =================================================== */
#define UDB_BCTL_BOTSEL_U_CLK_SEL4_Pos    (0UL)                 /*!< UDB_BCTL BOTSEL_U: CLK_SEL4 (Bit 0)                       */
#define UDB_BCTL_BOTSEL_U_CLK_SEL4_Msk    (0x3UL)               /*!< UDB_BCTL BOTSEL_U: CLK_SEL4 (Bitfield-Mask: 0x03)         */
#define UDB_BCTL_BOTSEL_U_CLK_SEL5_Pos    (2UL)                 /*!< UDB_BCTL BOTSEL_U: CLK_SEL5 (Bit 2)                       */
#define UDB_BCTL_BOTSEL_U_CLK_SEL5_Msk    (0xcUL)               /*!< UDB_BCTL BOTSEL_U: CLK_SEL5 (Bitfield-Mask: 0x03)         */
#define UDB_BCTL_BOTSEL_U_CLK_SEL6_Pos    (4UL)                 /*!< UDB_BCTL BOTSEL_U: CLK_SEL6 (Bit 4)                       */
#define UDB_BCTL_BOTSEL_U_CLK_SEL6_Msk    (0x30UL)              /*!< UDB_BCTL BOTSEL_U: CLK_SEL6 (Bitfield-Mask: 0x03)         */
#define UDB_BCTL_BOTSEL_U_CLK_SEL7_Pos    (6UL)                 /*!< UDB_BCTL BOTSEL_U: CLK_SEL7 (Bit 6)                       */
#define UDB_BCTL_BOTSEL_U_CLK_SEL7_Msk    (0xc0UL)              /*!< UDB_BCTL BOTSEL_U: CLK_SEL7 (Bitfield-Mask: 0x03)         */
/* ===================================================  UDB_BCTL.QCLK_EN  ==================================================== */
#define UDB_BCTL_QCLK_EN_DCEN_Q_Pos       (0UL)                 /*!< UDB_BCTL QCLK_EN: DCEN_Q (Bit 0)                          */
#define UDB_BCTL_QCLK_EN_DCEN_Q_Msk       (0xffUL)              /*!< UDB_BCTL QCLK_EN: DCEN_Q (Bitfield-Mask: 0xff)            */
#define UDB_BCTL_QCLK_EN_BCEN_Q_Pos       (8UL)                 /*!< UDB_BCTL QCLK_EN: BCEN_Q (Bit 8)                          */
#define UDB_BCTL_QCLK_EN_BCEN_Q_Msk       (0x100UL)             /*!< UDB_BCTL QCLK_EN: BCEN_Q (Bitfield-Mask: 0x01)            */
#define UDB_BCTL_QCLK_EN_DISABLE_ROUTE_Pos (11UL)               /*!< UDB_BCTL QCLK_EN: DISABLE_ROUTE (Bit 11)                  */
#define UDB_BCTL_QCLK_EN_DISABLE_ROUTE_Msk (0x800UL)            /*!< UDB_BCTL QCLK_EN: DISABLE_ROUTE (Bitfield-Mask: 0x01)     */


/* ==================================================  UDB_UDBIF.BANK_CTL  =================================================== */
#define UDB_UDBIF_BANK_CTL_DIS_COR_Pos    (0UL)                 /*!< UDB_UDBIF BANK_CTL: DIS_COR (Bit 0)                       */
#define UDB_UDBIF_BANK_CTL_DIS_COR_Msk    (0x1UL)               /*!< UDB_UDBIF BANK_CTL: DIS_COR (Bitfield-Mask: 0x01)         */
#define UDB_UDBIF_BANK_CTL_ROUTE_EN_Pos   (1UL)                 /*!< UDB_UDBIF BANK_CTL: ROUTE_EN (Bit 1)                      */
#define UDB_UDBIF_BANK_CTL_ROUTE_EN_Msk   (0x2UL)               /*!< UDB_UDBIF BANK_CTL: ROUTE_EN (Bitfield-Mask: 0x01)        */
#define UDB_UDBIF_BANK_CTL_BANK_EN_Pos    (2UL)                 /*!< UDB_UDBIF BANK_CTL: BANK_EN (Bit 2)                       */
#define UDB_UDBIF_BANK_CTL_BANK_EN_Msk    (0x4UL)               /*!< UDB_UDBIF BANK_CTL: BANK_EN (Bitfield-Mask: 0x01)         */
#define UDB_UDBIF_BANK_CTL_READ_WAIT_Pos  (8UL)                 /*!< UDB_UDBIF BANK_CTL: READ_WAIT (Bit 8)                     */
#define UDB_UDBIF_BANK_CTL_READ_WAIT_Msk  (0x100UL)             /*!< UDB_UDBIF BANK_CTL: READ_WAIT (Bitfield-Mask: 0x01)       */
/* =================================================  UDB_UDBIF.INT_CLK_CTL  ================================================= */
#define UDB_UDBIF_INT_CLK_CTL_INT_CLK_ENABLE_Pos (0UL)          /*!< UDB_UDBIF INT_CLK_CTL: INT_CLK_ENABLE (Bit 0)             */
#define UDB_UDBIF_INT_CLK_CTL_INT_CLK_ENABLE_Msk (0x1UL)        /*!< UDB_UDBIF INT_CLK_CTL: INT_CLK_ENABLE (Bitfield-Mask: 0x01)*/
/* ===================================================  UDB_UDBIF.INT_CFG  =================================================== */
#define UDB_UDBIF_INT_CFG_INT_MODE_CFG_Pos (0UL)                /*!< UDB_UDBIF INT_CFG: INT_MODE_CFG (Bit 0)                   */
#define UDB_UDBIF_INT_CFG_INT_MODE_CFG_Msk (0xffffffffUL)       /*!< UDB_UDBIF INT_CFG: INT_MODE_CFG (Bitfield-Mask: 0xffffffff)*/
/* =================================================  UDB_UDBIF.TR_CLK_CTL  ================================================== */
#define UDB_UDBIF_TR_CLK_CTL_TR_CLOCK_ENABLE_Pos (0UL)          /*!< UDB_UDBIF TR_CLK_CTL: TR_CLOCK_ENABLE (Bit 0)             */
#define UDB_UDBIF_TR_CLK_CTL_TR_CLOCK_ENABLE_Msk (0x1UL)        /*!< UDB_UDBIF TR_CLK_CTL: TR_CLOCK_ENABLE (Bitfield-Mask: 0x01)*/
/* ===================================================  UDB_UDBIF.TR_CFG  ==================================================== */
#define UDB_UDBIF_TR_CFG_TR_MODE_CFG_Pos  (0UL)                 /*!< UDB_UDBIF TR_CFG: TR_MODE_CFG (Bit 0)                     */
#define UDB_UDBIF_TR_CFG_TR_MODE_CFG_Msk  (0xffffffffUL)        /*!< UDB_UDBIF TR_CFG: TR_MODE_CFG (Bitfield-Mask: 0xffffffff) */
/* ===================================================  UDB_UDBIF.PRIVATE  =================================================== */
#define UDB_UDBIF_PRIVATE_PIPELINE_MD_Pos (0UL)                 /*!< UDB_UDBIF PRIVATE: PIPELINE_MD (Bit 0)                    */
#define UDB_UDBIF_PRIVATE_PIPELINE_MD_Msk (0x1UL)               /*!< UDB_UDBIF PRIVATE: PIPELINE_MD (Bitfield-Mask: 0x01)      */


#endif /* _CYIP_UDB_H_ */


/* [] END OF FILE */
